Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_s_type.h
#ifndef _RTL8735B_SYSON_S_TYPE_H_
#define _RTL8735B_SYSON_S_TYPE_H_
#include "platform_conf.h"

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_ISO_CTRL
 * @brief                                            (@ 0X004)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_ISO_I2S2IPLL                   2
#define SYSON_S_BIT_ISO_I2S2IPLL                     ((u32)0x00000001 << 2)                              /*!<R/W 1  1: isolation I2S2PLL to SYSON domain; 0: disable isolation */
#define SYSON_S_SHIFT_ISO_I2S1IPLL                   1
#define SYSON_S_BIT_ISO_I2S1IPLL                     ((u32)0x00000001 << 1)                              /*!<R/W 1  1: isolation I2S1PLL to SYSON domain; 0: disable isolation */
#define SYSON_S_SHIFT_ISO_ISPPLL                     0
#define SYSON_S_BIT_ISO_ISPPLL                       ((u32)0x00000001 << 0)                              /*!<R/W 1  1: isolation ISPPLL to SYSON domain; 0: disable isolation */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_CLK_CTRL
 * @brief                                            (@ 0X008)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_I2S2IPLL_RDY                   2
#define SYSON_S_BIT_I2S2IPLL_RDY                     ((u32)0x00000001 << 2)                              /*!<R 0  1: I2S2 PLL ready */
#define SYSON_S_SHIFT_I2S1IPLL_RDY                   1
#define SYSON_S_BIT_I2S1IPLL_RDY                     ((u32)0x00000001 << 1)                              /*!<R 0  1: I2S1 PLL ready */
#define SYSON_S_SHIFT_ISPPLL_RDY                     0
#define SYSON_S_BIT_ISPPLL_RDY                       ((u32)0x00000001 << 0)                              /*!<R 0  1: ISP PLL ready */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_FUNC_EN
 * @brief                                            (@ 0X00C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_CPU_RST_MASK                   0
#define SYSON_S_BIT_CPU_RST_MASK                     ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Mask "cpu_r0_rst" 0: Reset Peripheral while CPU reset request */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_HS_PLATFORM_PARA
 * @brief                                            (@ 0X010)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_DRAM_ADAP_STATUS               10
#define SYSON_S_BIT_DRAM_ADAP_STATUS                 ((u32)0x00000001 << 10)                             /*!<R 0  dram_adap_idle Note: Tie to 0 in RTL */
#define SYSON_S_SHIFT_LEXRA_TO_AXI_ADAP7_IDLE        9
#define SYSON_S_BIT_LEXRA_TO_AXI_ADAP7_IDLE          ((u32)0x00000001 << 9)                              /*!<R 1  lxm7_idle */
#define SYSON_S_SHIFT_LEXRA_TO_AXI_ADAP6_IDLE        8
#define SYSON_S_BIT_LEXRA_TO_AXI_ADAP6_IDLE          ((u32)0x00000001 << 8)                              /*!<R 1  lxm6_idle */
#define SYSON_S_SHIFT_TM9_DBGRESTARTED_STATUS        3
#define SYSON_S_BIT_TM9_DBGRESTARTED_STATUS          ((u32)0x00000001 << 3)                              /*!<R 1  tm_dbgrestarted_m */
#define SYSON_S_SHIFT_TM9_HALTED_STATUS              2
#define SYSON_S_BIT_TM9_HALTED_STATUS                ((u32)0x00000001 << 2)                              /*!<R 0  tm_halted_m */
#define SYSON_S_SHIFT_TM9_LOCKUP_STATUS              1
#define SYSON_S_BIT_TM9_LOCKUP_STATUS                ((u32)0x00000001 << 1)                              /*!<R 0  tm_lockup_m */
#define SYSON_S_SHIFT_TM9_SLEEP_STATUS               0
#define SYSON_S_BIT_TM9_SLEEP_STATUS                 ((u32)0x00000001 << 0)                              /*!<R 0  tm_sl_sleepsys_r */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_I2S_PLL1_CTRL0
 * @brief                                            (@ 0X014)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_POW_ERC_I2S1                   31
#define SYSON_S_BIT_POW_ERC_I2S1                     ((u32)0x00000001 << 31)                             /*!<R/W 0  erc enable. */
#define SYSON_S_SHIFT_POW_DIV_IN_I2S1                30
#define SYSON_S_BIT_POW_DIV_IN_I2S1                  ((u32)0x00000001 << 30)                             /*!<R/W 0  input divider enable (need pwl signal) 0 -> 1 */
#define SYSON_S_SHIFT_POW_PLL_I2S1                   29
#define SYSON_S_BIT_POW_PLL_I2S1                     ((u32)0x00000001 << 29)                             /*!<R/W 0  (need pwl signal) 0 -> 1 */
#define SYSON_S_SHIFT_REG_CP_BIA_I2S1                26
#define SYSON_S_MASK_REG_CP_BIA_I2S1                 ((u32)0x00000007 << 26)                             /*!<R/W 000  charge pump current selection . Default=10uA CP current select : 000: Icp=10uA, 001: Icp=15uA, 010: Icp=20uA, 011: Icp=25uA; 100: Icp=30uA, 101: Icp=35uA, 110: Icp=40uA, 111: Icp=450uA;  */
#define SYSON_S_SHIFT_DOGENB_I2S1                    25
#define SYSON_S_BIT_DOGENB_I2S1                      ((u32)0x00000001 << 25)                             /*!<R/W 0  0: watch dog on, 1: watch dog off */
#define SYSON_S_SHIFT_REG_PS_I2S1                    22
#define SYSON_S_MASK_REG_PS_I2S1                     ((u32)0x00000007 << 22)                             /*!<R/W 000   */
#define SYSON_S_SHIFT_REG_PSEN_I2S1                  21
#define SYSON_S_BIT_REG_PSEN_I2S1                    ((u32)0x00000001 << 21)                             /*!<R/W 1  phase selector enable */
#define SYSON_S_SHIFT_REG_CP_SET_I2S1                19
#define SYSON_S_MASK_REG_CP_SET_I2S1                 ((u32)0x00000003 << 19)                             /*!<R/W 11  Cp selection. Default=6p 00: Cp=3p, 01: Cp=4p, 10: Cp=5p, 11: Cp=6p */
#define SYSON_S_SHIFT_REG_RS_SET_I2S1                16
#define SYSON_S_MASK_REG_RS_SET_I2S1                 ((u32)0x00000007 << 16)                             /*!<R/W 101  Rs selection. Default=7k 000: Rs=15k, 001: Rs=13k, 010: Rs=11k, 011: Rs=9k, 100: Rs=7k, 101: Rs=5k, 110: Rs=3k, 111: Rs=1k;  */
#define SYSON_S_SHIFT_REG_CS_SEL_I2S1                14
#define SYSON_S_MASK_REG_CS_SEL_I2S1                 ((u32)0x00000003 << 14)                             /*!<R/W 10  Cs selection. Default=60p 00: Cs=40p, 01: Cs=50p, 10: Cs=60p, 11: Cs=70p */
#define SYSON_S_SHIFT_REG_FREF_EDGE_I2S1             13
#define SYSON_S_BIT_REG_FREF_EDGE_I2S1               ((u32)0x00000001 << 13)                             /*!<R/W 1  0:fref, 1:frefb */
#define SYSON_S_SHIFT_REG_CK_EN_I2S1                 12
#define SYSON_S_BIT_REG_CK_EN_I2S1                   ((u32)0x00000001 << 12)                             /*!<R/W 1  output clk enable */
#define SYSON_S_SHIFT_REG_CK_EN_D2_I2S1              11
#define SYSON_S_BIT_REG_CK_EN_D2_I2S1                ((u32)0x00000001 << 11)                             /*!<R/W 1  output clk div 2 enable */
#define SYSON_S_SHIFT_REG_CK_OUT_SEL_I2S1_0          8
#define SYSON_S_MASK_REG_CK_OUT_SEL_I2S1_0           ((u32)0x00000007 << 8)                              /*!<R/W 000  reserved */
#define SYSON_S_SHIFT_REG_XTAL_MANUAL_MODE_I2S1      7
#define SYSON_S_BIT_REG_XTAL_MANUAL_MODE_I2S1        ((u32)0x00000001 << 7)                              /*!<R/W 1  reg_xtal_maunal_mode. Default=0 0: reg_xtal_sel<3:0> is controlled by REG, xtal_div_sel is controlled by mapping table. 1: reg_xtal_sel<3:0>=4'b1111, xtal_div_sel is controlled by reg_xtal_div_sel_maunal<1:0> */
#define SYSON_S_SHIFT_REG_XTAL_DIV_SEL_MANUAL_I2S1   5
#define SYSON_S_MASK_REG_XTAL_DIV_SEL_MANUAL_I2S1    ((u32)0x00000003 << 5)                              /*!<R/W 00  input divider selection in xtal maunal mode. Default=00 00=/1, 10=/2, 11=/4 */
#define SYSON_S_SHIFT_REG_VC_THL_I2S1                3
#define SYSON_S_MASK_REG_VC_THL_I2S1                 ((u32)0x00000003 << 3)                              /*!<R/W 00  VC voltage, Default=00 00: VC=1/4Vdd, 01: VC=1/2Vdd, 10=3/4Vdd, 11: VC=Vdd */
#define SYSON_S_SHIFT_C3_SET_I2S1                    1
#define SYSON_S_MASK_C3_SET_I2S1                     ((u32)0x00000003 << 1)                              /*!<R/W 00  C3 selection. Default=1p 00: 0.5p, 01: 1p, 10: Cs=1.5p, 11: 2p */
#define SYSON_S_SHIFT_R3_SET_I2S1                    0
#define SYSON_S_BIT_R3_SET_I2S1                      ((u32)0x00000001 << 0)                              /*!<R/W 1  Rs selection. Default=1k 0: 0 Ohm, 1: 1k Ohm */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_I2S_PLL1_CTRL1
 * @brief                                            (@ 0X018)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_REG_XTAL_SEL_I2S1              28
#define SYSON_S_MASK_REG_XTAL_SEL_I2S1               ((u32)0x0000000F << 28)                             /*!<R/W 0000  xtal selection, Default=40MHz 0000= 40MHz, 0001= 25MHz, 0010= 13MHz, 0011= 19.2MHz 0100= 20MHz, 0101= 26MHz, 0110= 38.4MHz, 0111= 17.664MHz 1000= 16MHz, 1001= 14.138MHz, 1010= 12MHz, 1011= 52MHz 1100= 48MHz, 1101= 27MHz, 1110= 24MHz, 1111= none  */
#define SYSON_S_SHIFT_REG_FREQ_SEL_I2S1              24
#define SYSON_S_MASK_REG_FREQ_SEL_I2S1               ((u32)0x0000000F << 24)                             /*!<R/W 0000  output clk selection, Default=196.608MHz 0000= 400MHz, 0001=300MHz, 0010= X, 0011= X, 0100= 216MHz, 0101=196.608MHz, 0110=192MHz, 0111= 180.632MHz, 1000= 148.5MHz,1001= X, 1010= X, 1011= X, 1100= X, 1101= X, 1110= X, 1111= 500MHz  */
#define SYSON_S_SHIFT_TBASE_FREQ_I2S1                20
#define SYSON_S_MASK_TBASE_FREQ_I2S1                 ((u32)0x0000000F << 20)                             /*!<R/W 1000   */
#define SYSON_S_SHIFT_STEP_FREQ_I2S1                 16
#define SYSON_S_MASK_STEP_FREQ_I2S1                  ((u32)0x0000000F << 16)                             /*!<R/W 0101  step size selection for switching freq. */
#define SYSON_S_SHIFT_TRIG_FREQ_I2S1                 15
#define SYSON_S_BIT_TRIG_FREQ_I2S1                   ((u32)0x00000001 << 15)                             /*!<R/W 0  freq. step up or step down enable */
#define SYSON_S_SHIFT_BB_DBG_SEL_AFE_SDM_I2S1        11
#define SYSON_S_MASK_BB_DBG_SEL_AFE_SDM_I2S1         ((u32)0x0000000F << 11)                             /*!<R/W 0000   */
#define SYSON_S_SHIFT_DIVN_SDM_I2S1                  5
#define SYSON_S_MASK_DIVN_SDM_I2S1                   ((u32)0x0000003F << 5)                              /*!<R/W 111  393.216M (93.304M/24.576M) 40M: 000111 26M: 001101  */
#define SYSON_S_SHIFT_REG_CK_OUT_SEL_I2S1_1          1
#define SYSON_S_MASK_REG_CK_OUT_SEL_I2S1_1           ((u32)0x0000000F << 1)                              /*!<R/W 1110  output divider selection. Default=1110(/16) 0000=/1, 1000=/2, 1100=/8, 1110=/16, 1111=/32 */
#define SYSON_S_SHIFT_ICP_HALF_I2S1                  0
#define SYSON_S_BIT_ICP_HALF_I2S1                    ((u32)0x00000001 << 0)                              /*!<R/W 1  charge pump current half or not 0: no half 1: half */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_I2S_PLL1_CTRL2
 * @brief                                            (@ 0X01C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_STEP_I2S1                      19
#define SYSON_S_MASK_STEP_I2S1                       ((u32)0x00001FFF << 19)                             /*!<R/W 0000000000000  ssc step size selection. */
#define SYSON_S_SHIFT_TBASE_I2S1                     7
#define SYSON_S_MASK_TBASE_I2S1                      ((u32)0x00000FFF << 7)                              /*!<R/W 000000000000  ssc freq selection */
#define SYSON_S_SHIFT_EN_SSC_I2S1                    6
#define SYSON_S_BIT_EN_SSC_I2S1                      ((u32)0x00000001 << 6)                              /*!<R/W 0  ssc enable. Default=0 */
#define SYSON_S_SHIFT_PLL_I2S1_2                     0
#define SYSON_S_MASK_PLL_I2S1_2                      ((u32)0x0000003F << 0)                              /*!<R/W 000000   */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_I2S_PLL1_CTRL3
 * @brief                                            (@ 0X020)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_F0F_SDM_I2S1                   19
#define SYSON_S_MASK_F0F_SDM_I2S1                    ((u32)0x00001FFF << 19)                             /*!<R/W 1  393.216M (93.304M/24.576M) 40M: 1_0100_1001_0101 26M: 1_1111_1010_1010 */
#define SYSON_S_SHIFT_F0N_SDM_I2S1                   16
#define SYSON_S_MASK_F0N_SDM_I2S1                    ((u32)0x00000007 << 16)                             /*!<R/W 110  393.216M (93.304M/24.576M) 40M: 110 26M: 000 */
#define SYSON_S_SHIFT_ORDER_SDM_I2S1                 15
#define SYSON_S_BIT_ORDER_SDM_I2S1                   ((u32)0x00000001 << 15)                             /*!<R/W 0  SDM order */
#define SYSON_S_SHIFT_PLL_I2S1_3                     0
#define SYSON_S_MASK_PLL_I2S1_3                      ((u32)0x00007FFF << 0)                              /*!<R/W 000000000000000   */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_I2S_PLL2_CTRL0
 * @brief                                            (@ 0X024)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_POW_ERC_I2S2                   31
#define SYSON_S_BIT_POW_ERC_I2S2                     ((u32)0x00000001 << 31)                             /*!<R/W 0  erc enable. */
#define SYSON_S_SHIFT_POW_DIV_IN_I2S2                30
#define SYSON_S_BIT_POW_DIV_IN_I2S2                  ((u32)0x00000001 << 30)                             /*!<R/W 0  input divider enable (need pwl signal) 0 -> 1 */
#define SYSON_S_SHIFT_POW_PLL_I2S2                   29
#define SYSON_S_BIT_POW_PLL_I2S2                     ((u32)0x00000001 << 29)                             /*!<R/W 0  (need pwl signal) 0 -> 1 */
#define SYSON_S_SHIFT_REG_CP_BIA_I2S2                26
#define SYSON_S_MASK_REG_CP_BIA_I2S2                 ((u32)0x00000007 << 26)                             /*!<R/W 000  charge pump current selection . Default=10uA CP current select : 000: Icp=10uA, 001: Icp=15uA, 010: Icp=20uA, 011: Icp=25uA; 100: Icp=30uA, 101: Icp=35uA, 110: Icp=40uA, 111: Icp=450uA;  */
#define SYSON_S_SHIFT_DOGENB_I2S2                    25
#define SYSON_S_BIT_DOGENB_I2S2                      ((u32)0x00000001 << 25)                             /*!<R/W 0  0: watch dog on, 1: watch dog off */
#define SYSON_S_SHIFT_REG_PS_I2S2                    22
#define SYSON_S_MASK_REG_PS_I2S2                     ((u32)0x00000007 << 22)                             /*!<R/W 000   */
#define SYSON_S_SHIFT_REG_PSEN_I2S2                  21
#define SYSON_S_BIT_REG_PSEN_I2S2                    ((u32)0x00000001 << 21)                             /*!<R/W 1  phase selector enable */
#define SYSON_S_SHIFT_REG_CP_SET_I2S2                19
#define SYSON_S_MASK_REG_CP_SET_I2S2                 ((u32)0x00000003 << 19)                             /*!<R/W 11  Cp selection. Default=6p 00: Cp=4p, 01: Cp=5p, 10: Cp=6p, 11: Cp=7p */
#define SYSON_S_SHIFT_REG_RS_SET_I2S2                16
#define SYSON_S_MASK_REG_RS_SET_I2S2                 ((u32)0x00000007 << 16)                             /*!<R/W 101  Rs selection. Default=5k 000: Rs=15k, 001: Rs=13k, 010: Rs=11k, 011: Rs=9k, 100: Rs=7k, 101: Rs=5k, 110: Rs=3k, 111: Rs=1k; 40M = 5k(101), 26M = 5k(101) */
#define SYSON_S_SHIFT_REG_CS_SEL_I2S2                14
#define SYSON_S_MASK_REG_CS_SEL_I2S2                 ((u32)0x00000003 << 14)                             /*!<R/W 10  Cs selection. Default=60p 00: Cs=40p, 01: Cs=50p, 10: Cs=60p, 11: Cs=70p */
#define SYSON_S_SHIFT_REG_FREF_EDGE_I2S2             13
#define SYSON_S_BIT_REG_FREF_EDGE_I2S2               ((u32)0x00000001 << 13)                             /*!<R/W 1  0:fref, 1:frefb */
#define SYSON_S_SHIFT_REG_CK_EN_I2S2                 12
#define SYSON_S_BIT_REG_CK_EN_I2S2                   ((u32)0x00000001 << 12)                             /*!<R/W 1  output clk enable */
#define SYSON_S_SHIFT_REG_CK_EN_D2_I2S2              11
#define SYSON_S_BIT_REG_CK_EN_D2_I2S2                ((u32)0x00000001 << 11)                             /*!<R/W 0  output clk div 2 enable */
#define SYSON_S_SHIFT_REG_CK_OUT_SEL_I2S2_0          8
#define SYSON_S_MASK_REG_CK_OUT_SEL_I2S2_0           ((u32)0x00000007 << 8)                              /*!<R/W 0  reserved */
#define SYSON_S_SHIFT_REG_XTAL_MANUAL_MODE_I2S2      7
#define SYSON_S_BIT_REG_XTAL_MANUAL_MODE_I2S2        ((u32)0x00000001 << 7)                              /*!<R/W 1  reg_xtal_maunal_mode. Default=0 0: reg_xtal_sel<3:0> is controlled by REG, xtal_div_sel is controlled by mapping table. 1: reg_xtal_sel<3:0>=4'b1111, xtal_div_sel is controlled by reg_xtal_div_sel_maunal<1:0> */
#define SYSON_S_SHIFT_REG_XTAL_DIV_SEL_MANUAL_I2S2   5
#define SYSON_S_MASK_REG_XTAL_DIV_SEL_MANUAL_I2S2    ((u32)0x00000003 << 5)                              /*!<R/W 00  input divider selection in xtal maunal mode. Default=00 00=/1, 01=/2, 1X=/4 */
#define SYSON_S_SHIFT_REG_VC_THL_I2S2                3
#define SYSON_S_MASK_REG_VC_THL_I2S2                 ((u32)0x00000003 << 3)                              /*!<R/W 00  VC voltage, Default=00 00: VC=1/4Vdd, 01: VC=1/2Vdd, 10=3/4Vdd, 11: VC=Vdd */
#define SYSON_S_SHIFT_C3_SET_I2S2                    1
#define SYSON_S_MASK_C3_SET_I2S2                     ((u32)0x00000003 << 1)                              /*!<R/W 0  C3 selection. Default=1p 00: 0.5p, 01: 1p, 10: Cs=1.5p, 11: 2p */
#define SYSON_S_SHIFT_R3_SET_I2S2                    0
#define SYSON_S_BIT_R3_SET_I2S2                      ((u32)0x00000001 << 0)                              /*!<R/W 1  Rs selection. Default=1k 0: 0 Ohm, 1: 1k Ohm */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_I2S_PLL2_CTRL1
 * @brief                                            (@ 0X028)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_REG_XTAL_SEL_I2S2              28
#define SYSON_S_MASK_REG_XTAL_SEL_I2S2               ((u32)0x0000000F << 28)                             /*!<R/W 0000  xtal selection, Default=40MHz 0000= 40MHz, 0001= 25MHz, 0010= 13MHz, 0011= 19.2MHz 0100= 20MHz, 0101= 26MHz, 0110= 38.4MHz, 0111= 17.664MHz 1000= 16MHz, 1001= 14.138MHz, 1010= 12MHz, 1011= 52MHz 1100= 48MHz, 1101= 27MHz, 1110= 24MHz, 1111= none  */
#define SYSON_S_SHIFT_REG_FREQ_SEL_I2S2              24
#define SYSON_S_MASK_REG_FREQ_SEL_I2S2               ((u32)0x0000000F << 24)                             /*!<R/W 0  output clk selection, Default=180.632MHz 0000= 400MHz, 0001= X, 0010= X, 0011= X, 0100= 216MHz, 0101=196.608MHz, 0110=192MHz, 0111= 180.632MHz, 1000= 148.5MHz,1001= X, 1010= X, 1011= X, 1100= X, 1101= X, 1110= X, 1111= 500MHz  */
#define SYSON_S_SHIFT_TBASE_FREQ_I2S2                20
#define SYSON_S_MASK_TBASE_FREQ_I2S2                 ((u32)0x0000000F << 20)                             /*!<R/W 1000   */
#define SYSON_S_SHIFT_STEP_FREQ_I2S2                 16
#define SYSON_S_MASK_STEP_FREQ_I2S2                  ((u32)0x0000000F << 16)                             /*!<R/W 0101  step size selection for switching freq. */
#define SYSON_S_SHIFT_TRIG_FREQ_I2S2                 15
#define SYSON_S_BIT_TRIG_FREQ_I2S2                   ((u32)0x00000001 << 15)                             /*!<R/W 0  freq. step up or step down enable */
#define SYSON_S_SHIFT_BB_DBG_SEL_AFE_SDM_I2S2        11
#define SYSON_S_MASK_BB_DBG_SEL_AFE_SDM_I2S2         ((u32)0x0000000F << 11)                             /*!<R/W 0000   */
#define SYSON_S_SHIFT_DIVN_SDM_I2S2                  5
#define SYSON_S_MASK_DIVN_SDM_I2S2                   ((u32)0x0000003F << 5)                              /*!<R/W 111  361.264M (45.158M) 40M: 000111 26M: 001101  */
#define SYSON_S_SHIFT_REG_CK_OUT_SEL_I2S2_1          1
#define SYSON_S_MASK_REG_CK_OUT_SEL_I2S2_1           ((u32)0x0000000F << 1)                              /*!<R/W 1100  output divider selection. Default=1100(/8) 0000=/1, 1000=/2, 1100=/8, 1110=/16, 1111=/32 */
#define SYSON_S_SHIFT_ICP_HALF_I2S2                  0
#define SYSON_S_BIT_ICP_HALF_I2S2                    ((u32)0x00000001 << 0)                              /*!<R/W 1  charge pump current half or not 0: no half 1: half */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_I2S_PLL2_CTRL2
 * @brief                                            (@ 0X02C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_STEP_I2S2                      19
#define SYSON_S_MASK_STEP_I2S2                       ((u32)0x00001FFF << 19)                             /*!<R/W 0000000000000  ssc step size selection. */
#define SYSON_S_SHIFT_TBASE_I2S2                     7
#define SYSON_S_MASK_TBASE_I2S2                      ((u32)0x00000FFF << 7)                              /*!<R/W 000000000000  ssc freq selection */
#define SYSON_S_SHIFT_EN_SSC_I2S2                    6
#define SYSON_S_BIT_EN_SSC_I2S2                      ((u32)0x00000001 << 6)                              /*!<R/W 0  ssc enable. Default=0 */
#define SYSON_S_SHIFT_PLL_I2S2_2                     0
#define SYSON_S_MASK_PLL_I2S2_2                      ((u32)0x0000003F << 0)                              /*!<R/W 000000   */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_I2S_PLL2_CTRL3
 * @brief                                            (@ 0X030)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_F0F_SDM_I2S2                   19
#define SYSON_S_MASK_F0F_SDM_I2S2                    ((u32)0x00001FFF << 19)                             /*!<R/W 1  361.264M (45.158M) 40M: 0_1000_0001_0111 26M: 0_0101_0001_0000  */
#define SYSON_S_SHIFT_F0N_SDM_I2S2                   16
#define SYSON_S_MASK_F0N_SDM_I2S2                    ((u32)0x00000007 << 16)                             /*!<R/W 000  361.264M (45.158M) 40M: 000 26M: 111  */
#define SYSON_S_SHIFT_ORDER_SDM_I2S2                 15
#define SYSON_S_BIT_ORDER_SDM_I2S2                   ((u32)0x00000001 << 15)                             /*!<R/W 0  SDM order */
#define SYSON_S_SHIFT_PLL_I2S2_3                     0
#define SYSON_S_MASK_PLL_I2S2_3                      ((u32)0x00007FFF << 0)                              /*!<R/W 000000000000000   */
/** @} */

