Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_s_type.h
/**************************************************************************//**
 * @defgroup SYSON_S_REG_ISP_PLL_CTRL0
 * @brief                                            (@ 0X034)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_POW_ERC_ISP                    31
#define SYSON_S_BIT_POW_ERC_ISP                      ((u32)0x00000001 << 31)                             /*!<R/W 0  erc enable. */
#define SYSON_S_SHIFT_POW_DIV_IN_ISP                 30
#define SYSON_S_BIT_POW_DIV_IN_ISP                   ((u32)0x00000001 << 30)                             /*!<R/W 0  input divider enable (need pwl signal) 0 -> 1 */
#define SYSON_S_SHIFT_POW_PLL_ISP                    29
#define SYSON_S_BIT_POW_PLL_ISP                      ((u32)0x00000001 << 29)                             /*!<R/W 0  (need pwl signal) 0 -> 1 */
#define SYSON_S_SHIFT_REG_CP_BIA_ISP                 26
#define SYSON_S_MASK_REG_CP_BIA_ISP                  ((u32)0x00000007 << 26)                             /*!<R/W 000  charge pump current selection . Default=10uA CP current select : 000: Icp=10uA, 001: Icp=15uA, 010: Icp=20uA, 011: Icp=25uA; 100: Icp=30uA, 101: Icp=35uA, 110: Icp=40uA, 111: Icp=450uA;  */
#define SYSON_S_SHIFT_DOGENB_ISP                     25
#define SYSON_S_BIT_DOGENB_ISP                       ((u32)0x00000001 << 25)                             /*!<R/W 0  0: watch dog on, 1: watch dog off */
#define SYSON_S_SHIFT_REG_PS_ISP                     22
#define SYSON_S_MASK_REG_PS_ISP                      ((u32)0x00000007 << 22)                             /*!<R/W 000   */
#define SYSON_S_SHIFT_REG_PSEN_ISP                   21
#define SYSON_S_BIT_REG_PSEN_ISP                     ((u32)0x00000001 << 21)                             /*!<R/W 1  phase selector enable */
#define SYSON_S_SHIFT_REG_CP_SET_ISP                 19
#define SYSON_S_MASK_REG_CP_SET_ISP                  ((u32)0x00000003 << 19)                             /*!<R/W 11  Cp selection. Default=6p 00: Cp=3p, 01: Cp=4p, 10: Cp=5p, 11: Cp=6p */
#define SYSON_S_SHIFT_REG_RS_SET_ISP                 16
#define SYSON_S_MASK_REG_RS_SET_ISP                  ((u32)0x00000007 << 16)                             /*!<R/W 101  Rs selection. Default=7k 000: Rs=15k, 001: Rs=13k, 010: Rs=11k, 011: Rs=9k, 100: Rs=7k, 101: Rs=5k, 110: Rs=3k, 111: Rs=1k;  */
#define SYSON_S_SHIFT_REG_CS_SEL_ISP                 14
#define SYSON_S_MASK_REG_CS_SEL_ISP                  ((u32)0x00000003 << 14)                             /*!<R/W 10  Cs selection. Default=60p 00: Cs=30p, 01: Cs=40p, 10: Cs=50p, 11: Cs=60p */
#define SYSON_S_SHIFT_REG_FREF_EDGE_ISP              13
#define SYSON_S_BIT_REG_FREF_EDGE_ISP                ((u32)0x00000001 << 13)                             /*!<R/W 1  0:fref, 1:frefb */
#define SYSON_S_SHIFT_REG_CK_EN_ISP                  12
#define SYSON_S_BIT_REG_CK_EN_ISP                    ((u32)0x00000001 << 12)                             /*!<R/W 1  output clk enable */
#define SYSON_S_SHIFT_REG_CK_EN_D2_ISP               11
#define SYSON_S_BIT_REG_CK_EN_D2_ISP                 ((u32)0x00000001 << 11)                             /*!<R/W 0  output clk div 2 enable */
#define SYSON_S_SHIFT_REG_CK_OUT_SEL_ISP0            8
#define SYSON_S_MASK_REG_CK_OUT_SEL_ISP0             ((u32)0x00000007 << 8)                              /*!<R/W 0  reserved */
#define SYSON_S_SHIFT_REG_XTAL_MANUAL_MODE_ISP       7
#define SYSON_S_BIT_REG_XTAL_MANUAL_MODE_ISP         ((u32)0x00000001 << 7)                              /*!<R/W 1  reg_xtal_maunal_mode. Default=0 0: reg_xtal_sel<3:0> is controlled by REG, xtal_div_sel is controlled by mapping table. 1: reg_xtal_sel<3:0>=4'b1111, xtal_div_sel is controlled by reg_xtal_div_sel_maunal<1:0> */
#define SYSON_S_SHIFT_REG_XTAL_DIV_SEL_MANUAL_ISP    5
#define SYSON_S_MASK_REG_XTAL_DIV_SEL_MANUAL_ISP     ((u32)0x00000003 << 5)                              /*!<R/W 00  input divider selection in xtal maunal mode. Default=00 00=/1, 01=/2, 1X=/4 */
#define SYSON_S_SHIFT_REG_VC_THL_ISP                 3
#define SYSON_S_MASK_REG_VC_THL_ISP                  ((u32)0x00000003 << 3)                              /*!<R/W 00  VC voltage, Default=00 00: VC=1/4Vdd, 01: VC=1/2Vdd, 10=3/4Vdd, 11: VC=Vdd */
#define SYSON_S_SHIFT_C3_SET_ISP                     1
#define SYSON_S_MASK_C3_SET_ISP                      ((u32)0x00000003 << 1)                              /*!<R/W 0  C3 selection. Default=1p 00: 0.5p, 01: 1p, 10: Cs=1.5p, 11: 2p */
#define SYSON_S_SHIFT_R3_SET_ISP                     0
#define SYSON_S_BIT_R3_SET_ISP                       ((u32)0x00000001 << 0)                              /*!<R/W 1  Rs selection. Default=1k 0: 0 Ohm, 1: 1k Ohm */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_ISP_PLL_CTRL1
 * @brief                                            (@ 0X038)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_REG_XTAL_SEL_ISP               28
#define SYSON_S_MASK_REG_XTAL_SEL_ISP                ((u32)0x0000000F << 28)                             /*!<R/W 0000  xtal selection, Default=40MHz 0000= 40MHz, 0001= 25MHz, 0010= 13MHz, 0011= 19.2MHz 0100= 20MHz, 0101= 26MHz, 0110= 38.4MHz, 0111= 17.664MHz 1000= 16MHz, 1001= 14.138MHz, 1010= 12MHz, 1011= 52MHz 1100= 48MHz, 1101= 27MHz, 1110= 24MHz, 1111= none  */
#define SYSON_S_SHIFT_REG_FREQ_SEL_ISP               24
#define SYSON_S_MASK_REG_FREQ_SEL_ISP                ((u32)0x0000000F << 24)                             /*!<R/W 0  output clk selection, Default=192MHz 0000= 400MHz, 0001=300MHz, 0010= X, 0011= X, 0100= 216MHz, 0101=196.608MHz, 0110=192MHz, 0111= 180.632MHz, 1000= 148.5MHz,1001= X, 1010= X, 1011= X, 1100= X, 1101= X, 1110= X, 1111= 500MHz  */
#define SYSON_S_SHIFT_TBASE_FREQ_ISP                 20
#define SYSON_S_MASK_TBASE_FREQ_ISP                  ((u32)0x0000000F << 20)                             /*!<R/W 1000   */
#define SYSON_S_SHIFT_STEP_FREQ_ISP                  16
#define SYSON_S_MASK_STEP_FREQ_ISP                   ((u32)0x0000000F << 16)                             /*!<R/W 0101  step size selection for switching freq. */
#define SYSON_S_SHIFT_TRIG_FREQ_ISP                  15
#define SYSON_S_BIT_TRIG_FREQ_ISP                    ((u32)0x00000001 << 15)                             /*!<R/W 0  freq. step up or step down enable */
#define SYSON_S_SHIFT_BB_DBG_SEL_AFE_SDM_ISP         11
#define SYSON_S_MASK_BB_DBG_SEL_AFE_SDM_ISP          ((u32)0x0000000F << 11)                             /*!<R/W 0000   */
#define SYSON_S_SHIFT_DIVN_SDM_ISP                   5
#define SYSON_S_MASK_DIVN_SDM_ISP                    ((u32)0x0000003F << 5)                              /*!<R/W 1111  384M (12M/24M) 40M: 000111 26M: 001100 297M (37.125M/74.25M) 40M: 000101 26M: 001001 432M (27M/54M) 40M: 001000 26M: 001110 */
#define SYSON_S_SHIFT_REG_CK_OUT_SEL_ISP1            1
#define SYSON_S_MASK_REG_CK_OUT_SEL_ISP1             ((u32)0x0000000F << 1)                              /*!<R/W 1110  output divider selection. Default=1110(/16) 0000=/1, 1000=/2, 1100=/8, 1110=/16, 1111=/32 */
#define SYSON_S_SHIFT_ICP_HALF_ISP                   0
#define SYSON_S_BIT_ICP_HALF_ISP                     ((u32)0x00000001 << 0)                              /*!<R/W 1  charge pump current half or not 0: no half 1: half */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_ISP_PLL_CTRL2
 * @brief                                            (@ 0X03C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_STEP_ISP                       19
#define SYSON_S_MASK_STEP_ISP                        ((u32)0x00001FFF << 19)                             /*!<R/W 0000000000000  ssc step size selection. */
#define SYSON_S_SHIFT_TBASE_ISP                      7
#define SYSON_S_MASK_TBASE_ISP                       ((u32)0x00000FFF << 7)                              /*!<R/W 000000000000  ssc freq selection */
#define SYSON_S_SHIFT_EN_SSC_ISP                     6
#define SYSON_S_BIT_EN_SSC_ISP                       ((u32)0x00000001 << 6)                              /*!<R/W 0  ssc enable. Default=0 */
#define SYSON_S_SHIFT_PLL_ISP_2                      0
#define SYSON_S_MASK_PLL_ISP_2                       ((u32)0x0000003F << 0)                              /*!<R/W 000000   */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_ISP_PLL_CTRL3
 * @brief                                            (@ 0X040)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_F0F_SDM_ISP                    19
#define SYSON_S_MASK_F0F_SDM_ISP                     ((u32)0x00001FFF << 19)                             /*!<R/W 1  384M (12M/24M) 40M: 1_1001_1001_1010 26M: 0_0100_1110_1100 297M (37.125M/74.25M) 40M: 0_1100_1100_1101 26M: 0_1100_0100_1111 432M (27M/54M) 40M: 0_1100_1100_1101 26M: 1_1101_1000_1010 */
#define SYSON_S_SHIFT_F0N_SDM_ISP                    16
#define SYSON_S_MASK_F0N_SDM_ISP                     ((u32)0x00000007 << 16)                             /*!<R/W 100  384M (12M/24M) 40M: 100 26M: 110 297M (37.125M/74.25M) 40M: 011 26M: 011 432M (27M/54M) 40M: 110 26M: 100 */
#define SYSON_S_SHIFT_ORDER_SDM_ISP                  15
#define SYSON_S_BIT_ORDER_SDM_ISP                    ((u32)0x00000001 << 15)                             /*!<R/W 0  SDM order */
#define SYSON_S_SHIFT_PLL_ISP_3                      0
#define SYSON_S_MASK_PLL_ISP_3                       ((u32)0x00007FFF << 0)                              /*!<R/W 000000000000000   */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_LDO_SDIO_CTRL
 * @brief                                            (@ 0X044)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_RESERVED1                      16
#define SYSON_S_MASK_RESERVED1                       ((u32)0x0000000F << 16)                             /*!<R/W 0   */
#define SYSON_S_SHIFT_REG_DMY_LDO_L                  14
#define SYSON_S_MASK_REG_DMY_LDO_L                   ((u32)0x00000003 << 14)                             /*!<R/W 00  // [REGU][LDO_SDIO] REG_CTRL // LDO dmy REG */
#define SYSON_S_SHIFT_REG_FORCE_DIODE_L              13
#define SYSON_S_BIT_REG_FORCE_DIODE_L                ((u32)0x00000001 << 13)                             /*!<R/W 0  // [REGU][LDO_SDIO] REG_CTRL // PGATE diode clamp (this is directly force no gating) // (purpose for powerCut mode iOCP) // 0: disable force diode clamp (default) // 1: enable force diode clamp */
#define SYSON_S_SHIFT_REG_BUFFERTYPE_SEL_L           12
#define SYSON_S_BIT_REG_BUFFERTYPE_SEL_L             ((u32)0x00000001 << 12)                             /*!<R/W 0  // [REGU][LDO_SDIO] REG_CTRL // LDO Buffer Type Select // LDO_SDIO should always set PMOS buffer // 0(default): PMOS buffer (for HV 3P3V) // 1: NMOS buffer (for HV 1P8V) */
#define SYSON_S_SHIFT_REG_DMYLOAD_L                  10
#define SYSON_S_MASK_REG_DMYLOAD_L                   ((u32)0x00000003 << 10)                             /*!<R/W 00  // [REGU][LDO_SDIO] REG_CTRL // LDO dmy load ctrl // 00(default): dmy load disable // 01: light dmy load enable (~160kohm) // 10: dmy load enable (~1kohm) // 11: dmy load + light dmy load both enable */
#define SYSON_S_SHIFT_REG_ITAIL_HALF_EN_L            9
#define SYSON_S_BIT_REG_ITAIL_HALF_EN_L              ((u32)0x00000001 << 9)                              /*!<R/W 0  // [REGU][LDO_SDIO] REG_CTRL // LDO iq half ctrl // 0(default): iq normal (for normal mode) // 1: iq half (for standby mode) */
#define SYSON_S_SHIFT_REG_STANDBY_L                  7
#define SYSON_S_MASK_REG_STANDBY_L                   ((u32)0x00000003 << 7)                              /*!<R/W 00  // [REGU][LDO_SDIO] REG_CTRL // LDO standby mode ctrl: // 00 (default): normal mode (iq normal + pwrmos 4x) // 01: debug mode (iq reduce + pwrmos 1x) // 10: debug mode (iq normal + pwrmos 4x) // 11: standby mode (iq reduce + pwrmos 1x) */
#define SYSON_S_SHIFT_EN_DIODE_L                     6
#define SYSON_S_BIT_EN_DIODE_L                       ((u32)0x00000001 << 6)                              /*!<R/W 1  // [REGU][LDO_SDIO] REG_CTRL // PGATE diode clamp (this gating to disable by pd_regu_L) // 0: disable clamp // 1: enable clamp (default) */
#define SYSON_S_SHIFT_VOADJ_L                        2
#define SYSON_S_MASK_VOADJ_L                         ((u32)0x0000000F << 2)                              /*!<R/W 1000  // LDO VOSEL // 0000 1.617 // 0001 1.642 // 0010 1.667 // 0011 1.694 // 0100 1.721 // 0101 1.749 // 0110 1.763 // 0111 1.778 // 1000 1.793 // 1001 1.839 // 1010 1.887 // 1011 1.938 // 1100 1.992 // 1101 2.905 // 1110 2.979 // 1111 3.047 */
#define SYSON_S_SHIFT_PD_REGU_L                      1
#define SYSON_S_BIT_PD_REGU_L                        ((u32)0x00000001 << 1)                              /*!<R/W 1  // [REGU][LDO_SDIO] REG_CTRL // PowerDown CTRL // 0: normal-Mode // 1: power-down Mode (default) */
#define SYSON_S_SHIFT_EN_PC_BT_L                     0
#define SYSON_S_BIT_EN_PC_BT_L                       ((u32)0x00000001 << 0)                              /*!<R/W 0  // [REGU][LDO_SDIO] REG_CTRL // PWRCUT enable // 0: LDO-Mode (default) // 1: PWRCUT-Mode */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_MEM_CTRL
 * @brief                                            (@ 0X048)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_BT_SRAM_MUX                    14
#define SYSON_S_BIT_BT_SRAM_MUX                      ((u32)0x00000001 << 14)                             /*!<R/W 0  SRAM4~8 0: BUS Memory, 1: BT Share Memory */
#define SYSON_S_SHIFT_SRAM8_RET                      13
#define SYSON_S_BIT_SRAM8_RET                        ((u32)0x00000001 << 13)                             /*!<R/W 0  1: SRAM8 Retention Mode */
#define SYSON_S_SHIFT_SRAM7_RET                      12
#define SYSON_S_BIT_SRAM7_RET                        ((u32)0x00000001 << 12)                             /*!<R/W 0  1: SRAM7 Retention Mode */
#define SYSON_S_SHIFT_SRAM6_RET                      11
#define SYSON_S_BIT_SRAM6_RET                        ((u32)0x00000001 << 11)                             /*!<R/W 0  1: SRAM6 Retention Mode */
#define SYSON_S_SHIFT_SRAM5_RET                      10
#define SYSON_S_BIT_SRAM5_RET                        ((u32)0x00000001 << 10)                             /*!<R/W 0  1: SRAM5 Retention Mode */
#define SYSON_S_SHIFT_SRAM4_RET                      9
#define SYSON_S_BIT_SRAM4_RET                        ((u32)0x00000001 << 9)                              /*!<R/W 0  1: SRAM4 Retention Mode */
#define SYSON_S_SHIFT_SRAM3_RET                      8
#define SYSON_S_BIT_SRAM3_RET                        ((u32)0x00000001 << 8)                              /*!<R/W 0  1: SRAM3 Retention Mode */
#define SYSON_S_SHIFT_SRAM2_RET                      7
#define SYSON_S_BIT_SRAM2_RET                        ((u32)0x00000001 << 7)                              /*!<R/W 0  1: SRAM2 Retention Mode */
#define SYSON_S_SHIFT_SRAM8_SD                       6
#define SYSON_S_BIT_SRAM8_SD                         ((u32)0x00000001 << 6)                              /*!<R/W 0  1: Shutdown SRAM8 */
#define SYSON_S_SHIFT_SRAM7_SD                       5
#define SYSON_S_BIT_SRAM7_SD                         ((u32)0x00000001 << 5)                              /*!<R/W 0  1: Shutdown SRAM7 */
#define SYSON_S_SHIFT_SRAM6_SD                       4
#define SYSON_S_BIT_SRAM6_SD                         ((u32)0x00000001 << 4)                              /*!<R/W 0  1: Shutdown SRAM6 */
#define SYSON_S_SHIFT_SRAM5_SD                       3
#define SYSON_S_BIT_SRAM5_SD                         ((u32)0x00000001 << 3)                              /*!<R/W 0  1: Shutdown SRAM5 */
#define SYSON_S_SHIFT_SRAM4_SD                       2
#define SYSON_S_BIT_SRAM4_SD                         ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Shutdown SRAM4 */
#define SYSON_S_SHIFT_SRAM3_SD                       1
#define SYSON_S_BIT_SRAM3_SD                         ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Shutdown SRAM3 */
#define SYSON_S_SHIFT_SRAM2_SD                       0
#define SYSON_S_BIT_SRAM2_SD                         ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Shutdown SRAM2 */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_SCE_EXMEM_CTRL0
 * @brief                                            (@ 0X054)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_RSVD1                          8
#define SYSON_S_MASK_RSVD1                           ((u32)0x00FFFFFF << 8)                              /*!<R/W 0  TBD */
#define SYSON_S_SHIFT_SCE_EXMEM_OP_ADDR              0
#define SYSON_S_MASK_SCE_EXMEM_OP_ADDR               ((u32)0x000000FF << 0)                              /*!<R/W 0  When you want to read or write data from or to SCE register, you need to fill the address to this register at first. Uint: 4 bytes Ex: "REG_SECURE_CTRL[7:0] = 0x2" represent that SCE register is 0x08. */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_SCE_EXMEM_CTRL1
 * @brief                                            (@ 0X058)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SCE_EXMEM_OP_DATA              0
#define SYSON_S_MASK_SCE_EXMEM_OP_DATA               ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  There are two operation in this register. One is reading process and the other is writing process. Reading Process: read data from SCE register according to REG_SCE_CONFIG[7:0]. Writing Process: write data to SCE register according to REG_SCE_CONFIG[7:0]. */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_SCE_FLASH_CTRL0
 * @brief                                            (@ 0X05C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_RSVD2                          8
#define SYSON_S_MASK_RSVD2                           ((u32)0x00FFFFFF << 8)                              /*!<R/W 0  TBD */
#define SYSON_S_SHIFT_SCE_FLASH_OP_ADDR              0
#define SYSON_S_MASK_SCE_FLASH_OP_ADDR               ((u32)0x000000FF << 0)                              /*!<R/W 0  When you want to read or write data from or to SCE register, you need to fill the address to this register at first. Uint: 4 bytes Ex: "REG_SECURE_CTRL[7:0] = 0x2" represent that SCE register is 0x08. */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_SCE_FLASH_CTRL1
 * @brief                                            (@ 0X060)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SCE_FLASH_OP_DATA              0
#define SYSON_S_MASK_SCE_FLASH_OP_DATA               ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  There are two operation in this register. One is reading process and the other is writing process. Reading Process: read data from SCE register according to REG_SCE_CONFIG[7:0]. Writing Process: write data to SCE register according to REG_SCE_CONFIG[7:0]. */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_SEC_EFUSE_CTRL0
 * @brief                                            (@ 0X064)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_RSVD3                          0
#define SYSON_S_MASK_RSVD3                           ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RSVD */
/** @} */

