Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_s_type.h
/**************************************************************************//**
 * @defgroup SYSON_S_REG_SEC_MASTER_SLAVE_PORT_IP_DIS
 * @brief                                            (@ 0X068)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_RSVD4                          17
#define SYSON_S_MASK_RSVD4                           ((u32)0x00007FFF << 17)                             /*!<R 0  RSVD */
#define SYSON_S_SHIFT_SEC_IP_CONFIG_LOCK_EN          16
#define SYSON_S_BIT_SEC_IP_CONFIG_LOCK_EN            ((u32)0x00000001 << 16)                             /*!<R/W1 Once 0  When this bit is written to '1', this bit cannot be written to '0'. Except the platform reset. 1: REG_SEC_MASTER_SLAVE_PORT_IP_DIS[15:0] can not be accessed. 0: REG_SEC_MASTER_SLAVE_PORT_IP_DIS[15:0] just can be accessed by secure state. */
#define SYSON_S_SHIFT_RSVD5                          14
#define SYSON_S_MASK_RSVD5                           ((u32)0x00000003 << 14)                             /*!<R/W 0  RSVD */
#define SYSON_S_SHIFT_SEC_NAND_FLASH_DIS             13
#define SYSON_S_BIT_SEC_NAND_FLASH_DIS               ((u32)0x00000001 << 13)                             /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for NAND FLASH registers. Master: 1: Disable that NAND FLASH is secure mode. It means that NAND FLASH is Non-secure master. 0: Enable that NAND FLASH is secure mode. (Default) It means that NAND FLASH is Secure master. Slave: 1: NAND FLASH is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access NAND FLASH registers. 0: NAND FLASH is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access NAND FLASH registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_SPORT_DIS                  12
#define SYSON_S_BIT_SEC_SPORT_DIS                    ((u32)0x00000001 << 12)                             /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for SPORT registers. Master: 1: Disable that SPORT is secure mode. It means that SPORT is Non-secure master. 0: Enable that SPORT is secure mode. (Default) It means that SPORT is Secure master. Slave: 1: SPORT is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access SPORT registers. 0: SPORT is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access SPORT registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_ENCODER_DIS                11
#define SYSON_S_BIT_SEC_ENCODER_DIS                  ((u32)0x00000001 << 11)                             /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for Encoder registers. Master: 1: Disable that Encoder is secure mode. It means that Encoder is Non-secure master. 0: Enable that Encoder is secure mode. (Default) It means that Encoder is Secure master. Slave: 1: Encoder is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access Encoder registers. 0: Encoder is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access Encoder registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_ISP_DIS                    10
#define SYSON_S_BIT_SEC_ISP_DIS                      ((u32)0x00000001 << 10)                             /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for ISP registers. Master: 1: Disable that ISP is secure mode. It means that ISP is Non-secure master. 0: Enable that ISP is secure mode. (Default) It means that ISP is Secure master. Slave: 1: ISP is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access ISP registers. 0: ISP is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access ISP registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_I2S_1_DIS                  9
#define SYSON_S_BIT_SEC_I2S_1_DIS                    ((u32)0x00000001 << 9)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for I2S_1 registers. Master: 1: Disable that I2S_1 is secure mode. It means that I2S_1 is Non-secure master. 0: Enable that I2S_1 is secure mode. (Default) It means that I2S_1 is Secure master. Slave: 1: I2S_1 is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access I2S_1 registers. 0: I2S_1 is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access I2S_1 registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_I2S_0_DIS                  8
#define SYSON_S_BIT_SEC_I2S_0_DIS                    ((u32)0x00000001 << 8)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for I2S_0 registers. Master: 1: Disable that I2S_0 is secure mode. It means that I2S_0 is Non-secure master. 0: Enable that I2S_0 is secure mode. (Default) It means that I2S_0 is Secure master. Slave: 1: I2S_0 is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access I2S_0 registers. 0: I2S_0 is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access I2S_0 registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_VOE_DIS                    7
#define SYSON_S_BIT_SEC_VOE_DIS                      ((u32)0x00000001 << 7)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for VOE registers. Master: 1: Disable that VOE is secure mode. It means that VOE is Non-secure master. 0: Enable that VOE is secure mode. (Default) It means that VOE is Secure master. Slave: 1: VOE is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access VOE registers. 0: VOE is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access VOE registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_NN_DIS                     6
#define SYSON_S_BIT_SEC_NN_DIS                       ((u32)0x00000001 << 6)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for NN registers. Master: 1: Disable that NN is secure mode. It means that NN is Non-secure master. 0: Enable that NN is secure mode. (Default) It means that NN is Secure master. Slave: 1: NN is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access NN registers. 0: NN is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access NN registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_OTG_DIS                    5
#define SYSON_S_BIT_SEC_OTG_DIS                      ((u32)0x00000001 << 5)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for OTG registers. Master: 1: Disable that OTG is secure mode. It means that OTG is Non-secure master. 0: Enable that OTG is secure mode. (Default) It means that OTG is Secure master. Slave: 1: OTG is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access OTG registers. 0: OTG is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access OTG registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_MII_DIS                    4
#define SYSON_S_BIT_SEC_MII_DIS                      ((u32)0x00000001 << 4)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for MII registers. Master: 1: Disable that MII is secure mode. It means that MII is Non-secure master. 0: Enable that MII is secure mode. (Default) It means that MII is Secure master. Slave: 1: MII is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access MII registers. 0: MII is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access MII registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_SD_HOST_DIS                3
#define SYSON_S_BIT_SEC_SD_HOST_DIS                  ((u32)0x00000001 << 3)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for SD_HOST registers. Master: 1: Disable that SD_HOST is secure mode. It means that SD_HOST is Non-secure master. 0: Enable that SD_HOST is secure mode. (Default) It means that SD_HOST is Secure master. Slave: 1: SD_HOST is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access SDIO_HOST registers. 0: SD_HOST is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access SD_HOST registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_SDIO_HOST_DIS              2
#define SYSON_S_BIT_SEC_SDIO_HOST_DIS                ((u32)0x00000001 << 2)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for SDIO_HOST registers. Master: 1: Disable that SDIO_HOST is secure mode. It means that SDIO_HOST is Non-secure master. 0: Enable that SDIO_HOST is secure mode. (Default) It means that SDIO_HOST is Secure master. Slave: 1: SDIO_HOST is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access SDIO_HOST registers. 0: SDIO_HOST is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access SDIO_HOST registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
#define SYSON_S_SHIFT_SEC_WLAN_DIS                   1
#define SYSON_S_BIT_SEC_WLAN_DIS                     ((u32)0x00000001 << 1)                              /*!<R/W Once 0  This bit is the control bit of secure filter check and protect signal bit for WLAN registers. Master: 1: Disable that WLAN is secure mode. It means that WLAN is Non-secure master. 0: Enable that WLAN is secure mode. (Default) It means that WLAN is Secure master. Slave: 1: WLAN is Non-secure register. It means that disable secure filter check , so allow Non-secure and Secure masters can access WLAN registers. 0: WLAN is Secure register. (Default) It means that enable secure filter check, so allow only Secure masters can access WLAN registers. Non-secure masters access will be filtered out. This bit is W Once. Re-configure them, unless the platform reset. */
/** @} */

