Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_s_type.h
/**************************************************************************//**
 * @defgroup SYSON_S_REG_SEC_SLAVE_PORT_IP_DIS
 * @brief                                            (@ 0X06C)
 * @{
 *****************************************************************************/
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define SYSON_S_SHIFT_RSVD6                          31
#define SYSON_S_BIT_RSVD6                            ((u32)0x00000001 << 31)                             /*!<R 0   */
#else
#define SYSON_S_SHIFT_SEC_BUS_REGU_CTRL_DIS          31
#define SYSON_S_BIT_SEC_BUS_REGU_CTRL_DIS            ((u32)0x00000001 << 31)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for BUS Regulator registers. 1: BUS Regulator is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access BUS Regulator registers. 0: BUS Regulator is Secure register. It means that enable secure filter check, so allow only Secure masters can access BUS Regulator registers. Non-secure masters access will be filtered out. */
#endif
#define SYSON_S_SHIFT_SEC_RSA_CTRL_DIS               30
#define SYSON_S_BIT_SEC_RSA_CTRL_DIS                 ((u32)0x00000001 << 30)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for RSA registers. 1: RSA is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access RSA registers. 0: RSA is Secure register. It means that enable secure filter check, so allow only Secure masters can access RSA registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_DDR_CTRL_DIS               29
#define SYSON_S_BIT_SEC_DDR_CTRL_DIS                 ((u32)0x00000001 << 29)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for DDR related (Ctrler/ PHY Ctrler/ PHY Calib/ Ctrler Func port) registers. 1: DDR related registers is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access DDR related registers. 0: DDR related registers is Secure register. It means that enable secure filter check, so allow only Secure masters can access DDR related registers. Non-secure masters access will be filtered out.  */
#define SYSON_S_SHIFT_SEC_FLASH_CTRL_DIS             28
#define SYSON_S_BIT_SEC_FLASH_CTRL_DIS               ((u32)0x00000001 << 28)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for Flash controller registers. 1: Flash controller is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access Flash controller registers. 0: Flash controller is Secure register. It means that enable secure filter check, so allow only Secure masters can access Flash controller registers. Non-secure masters access will be filtered out.  */
#define SYSON_S_SHIFT_SEC_HS_SPI1_DIS                27
#define SYSON_S_BIT_SEC_HS_SPI1_DIS                  ((u32)0x00000001 << 27)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for HS_SPI1 registers. 1: HS_SPI1 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access HS_SPI1 registers. 0: HS_SPI1 is Secure register. It means that enable secure filter check, so allow only Secure masters can access HS_SPI1 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_HS_SPI0_DIS                26
#define SYSON_S_BIT_SEC_HS_SPI0_DIS                  ((u32)0x00000001 << 26)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for HS_SPI0 registers. 1: HS_SPI0 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access HS_SPI0 registers. 0: HS_SPI0 is Secure register. It means that enable secure filter check, so allow only Secure masters can access HS_SPI0 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_SPI1_DIS                   25
#define SYSON_S_BIT_SEC_SPI1_DIS                     ((u32)0x00000001 << 25)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for SPI1 registers. 1: SPI1 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access SPI1 registers. 0: SPI1 is Secure register. It means that enable secure filter check, so allow only Secure masters can access SPI1 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_SPI0_DIS                   24
#define SYSON_S_BIT_SEC_SPI0_DIS                     ((u32)0x00000001 << 24)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for SPI0 registers. 1: SPI0 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access SPI0 registers. 0: SPI0 is Secure register. It means that enable secure filter check, so allow only Secure masters can access SPI0 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_ED2519_DIS                 23
#define SYSON_S_BIT_SEC_ED2519_DIS                   ((u32)0x00000001 << 23)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for ED25519 registers. 1: ED25519 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access ED25519 registers. 0: ED25519 is Secure register. It means that enable secure filter check, so allow only Secure masters can access ED25519 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_ECDSA_DIS                  22
#define SYSON_S_BIT_SEC_ECDSA_DIS                    ((u32)0x00000001 << 22)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for ECDSA registers. 1: ECDSA is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access ECDSA registers. 0: ECDSA is Secure register. It means that enable secure filter check, so allow only Secure masters can access ECDSA registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_CODEC_DIS                  21
#define SYSON_S_BIT_SEC_CODEC_DIS                    ((u32)0x00000001 << 21)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for CODEC registers. 1: CODEC is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access CODEC registers. 0: CODEC is Secure register. It means that enable secure filter check, so allow only Secure masters can access CODEC registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_SGPIO_DIS                  20
#define SYSON_S_BIT_SEC_SGPIO_DIS                    ((u32)0x00000001 << 20)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for SGPIO registers. 1: SGPIO is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access SGPIO registers. 0: SGPIO is Secure register. It means that enable secure filter check, so allow only Secure masters can access SGPIO registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_PWM_DIS                    19
#define SYSON_S_BIT_SEC_PWM_DIS                      ((u32)0x00000001 << 19)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for PWM registers. 1: PWM is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access PWM registers. 0: PWM is Secure register. It means that enable secure filter check, so allow only Secure masters can access PWM registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_ADC_DIS                    18
#define SYSON_S_BIT_SEC_ADC_DIS                      ((u32)0x00000001 << 18)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for ADC registers. 1: ADC is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access ADC registers. 0: ADC is Secure register. It means that enable secure filter check, so allow only Secure masters can access ADC registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_UART4_DIS                  17
#define SYSON_S_BIT_SEC_UART4_DIS                    ((u32)0x00000001 << 17)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for UART4 registers.(BT UART) 1: UART4 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access UART4 registers. 0: UART4 is Secure register. It means that enable secure filter check, so allow only Secure masters can access UART4 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_UART3_DIS                  16
#define SYSON_S_BIT_SEC_UART3_DIS                    ((u32)0x00000001 << 16)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for UART3 registers. 1: UART3 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access UART3 registers. 0: UART3 is Secure register. It means that enable secure filter check, so allow only Secure masters can access UART3 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_UART2_DIS                  15
#define SYSON_S_BIT_SEC_UART2_DIS                    ((u32)0x00000001 << 15)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for UART2 registers. 1: UART2 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access UART2 registers. 0: UART2 is Secure register. It means that enable secure filter check, so allow only Secure masters can access UART2 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_UART1_DIS                  14
#define SYSON_S_BIT_SEC_UART1_DIS                    ((u32)0x00000001 << 14)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for UART1 registers. 1: UART1 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access UART1 registers. 0: UART1 is Secure register. It means that enable secure filter check, so allow only Secure masters can access UART1 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_UART0_DIS                  13
#define SYSON_S_BIT_SEC_UART0_DIS                    ((u32)0x00000001 << 13)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for UART0 registers. 1: UART0 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access UART0 registers. 0: UART0 is Secure register. It means that enable secure filter check, so allow only Secure masters can access UART0 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_TRNG_DIS                   12
#define SYSON_S_BIT_SEC_TRNG_DIS                     ((u32)0x00000001 << 12)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for TRNG registers. 1: TRNG is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access TRNG registers. 0: TRNG is Secure register. It means that enable secure filter check, so allow only Secure masters can access TRNG registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_I2C3_DIS                   11
#define SYSON_S_BIT_SEC_I2C3_DIS                     ((u32)0x00000001 << 11)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for I2C3 registers. 1: I2C3 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access I2C3 registers. 0: I2C3 is Secure register. It means that enable secure filter check, so allow only Secure masters can access I2C3 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_I2C2_DIS                   10
#define SYSON_S_BIT_SEC_I2C2_DIS                     ((u32)0x00000001 << 10)                             /*!<R/W Once 1  This bit is the control bit of secure filter check for I2C2 registers. 1: I2C2 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access I2C2 registers. 0: I2C2 is Secure register. It means that enable secure filter check, so allow only Secure masters can access I2C2 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_I2C1_DIS                   9
#define SYSON_S_BIT_SEC_I2C1_DIS                     ((u32)0x00000001 << 9)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for I2C1 registers. 1: I2C1 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access I2C1 registers. 0: I2C1 is Secure register. It means that enable secure filter check, so allow only Secure masters can access I2C1 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_I2C0_DIS                   8
#define SYSON_S_BIT_SEC_I2C0_DIS                     ((u32)0x00000001 << 8)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for I2C0 registers. 1: I2C0 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access I2C0 registers. 0: I2C0 is Secure register. It means that enable secure filter check, so allow only Secure masters can access I2C0 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_GTIMER3_DIS                7
#define SYSON_S_BIT_SEC_GTIMER3_DIS                  ((u32)0x00000001 << 7)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for GTIMER3 registers. 1: GTIMER3 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access GTIMER3 registers. 0: GTIMER3 is Secure register. It means that enable secure filter check, so allow only Secure masters can access GTIMER3 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_GTIMER2_DIS                6
#define SYSON_S_BIT_SEC_GTIMER2_DIS                  ((u32)0x00000001 << 6)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for GTIMER2 registers. 1: GTIMER2 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access GTIMER2 registers. 0: GTIMER2 is Secure register. It means that enable secure filter check, so allow only Secure masters can access GTIMER2 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_GTIMER1_DIS                5
#define SYSON_S_BIT_SEC_GTIMER1_DIS                  ((u32)0x00000001 << 5)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for GTIMER1 registers. 1: GTIMER1 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access GTIMER1 registers. 0: GTIMER1 is Secure register. It means that enable secure filter check, so allow only Secure masters can access GTIMER1 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_GTIMER0_DIS                4
#define SYSON_S_BIT_SEC_GTIMER0_DIS                  ((u32)0x00000001 << 4)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for GTIMER0 registers. 1: GTIMER0 is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access GTIMER0 registers. 0: GTIMER0 is Secure register. It means that enable secure filter check, so allow only Secure masters can access GTIMER0 registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_SYSON_GPIO_DIS             3
#define SYSON_S_BIT_SEC_SYSON_GPIO_DIS               ((u32)0x00000001 << 3)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for SYSON_GPIO registers. 1: SYSON_GPIO is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access SYSON_GPIO registers. 0: SYSON_GPIO is Secure register. It means that enable secure filter check, so allow only Secure masters can access SYSON_GPIO registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_PON_GPIO_DIS               2
#define SYSON_S_BIT_SEC_PON_GPIO_DIS                 ((u32)0x00000001 << 2)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for PON_GPIO registers. 1: PON_GPIO is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access PON_GPIO registers. 0: PON_GPIO is Secure register. It means that enable secure filter check, so allow only Secure masters can access PON_GPIO registers. Non-secure masters access will be filtered out. */
#define SYSON_S_SHIFT_SEC_AON_GPIO_DIS               1
#define SYSON_S_BIT_SEC_AON_GPIO_DIS                 ((u32)0x00000001 << 1)                              /*!<R/W Once 1  This bit is the control bit of secure filter check for AON_GPIO registers. 1: AON_GPIO is Non-secure register. (Default) It means that disable secure filter check, so allow Non-secure and Secure masters can access AON_GPIO registers. 0: AON_GPIO is Secure register. It means that enable secure filter check, so allow only Secure masters can access AON_GPIO registers. Non-secure masters access will be filtered out. */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_SEC_CTRL
 * @brief                                            (@ 0X074)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_FLASH_SEC_KEY_RDY_EN           4
#define SYSON_S_BIT_FLASH_SEC_KEY_RDY_EN             ((u32)0x00000001 << 4)                              /*!<R/W 0  Flash SEC key_ready control bit(For Engine reset wait for key_ready pull high, then latch key values)  */
#define SYSON_S_SHIFT_SCE_KEY_SEL                    2
#define SYSON_S_MASK_SCE_KEY_SEL                     ((u32)0x00000003 << 2)                              /*!<R/W 0  2'b0 : Only key 1 load into Flash SEC 2 key regions 2'b1 : Only key 2 load into Flash SEC 2 key regions 2'b2 : key 1 load into Flash SEC key 1 region; key 2 load into Flash SEC key 2 region 2'b3 : key 1 load into Flash SEC key 2 region; key 2 load into Flash SEC key 1 region  */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_RSA_FUNC_CTRL
 * @brief                                            (@ 0X078)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_RSA_EN                         1
#define SYSON_S_BIT_RSA_EN                           ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable RSA */
#define SYSON_S_SHIFT_RSA_CLK_EN                     0
#define SYSON_S_BIT_RSA_CLK_EN                       ((u32)0x00000001 << 0)                              /*!<R/W 0  1: EnableRSA CLK */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_LPDDR1_CTRL
 * @brief                                            (@ 0X080)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_HS_LPDDR1_SPEEDUP              8
#define SYSON_S_BIT_HS_LPDDR1_SPEEDUP                ((u32)0x00000001 << 8)                              /*!<R/W 0  rxi310_speedup_sim */
#define SYSON_S_SHIFT_HS_LPDDR1_CLK_EN               4
#define SYSON_S_BIT_HS_LPDDR1_CLK_EN                 ((u32)0x00000001 << 4)                              /*!<R/W 0  memory control function enable  */
#define SYSON_S_SHIFT_HS_LPDDR1_EN                   0
#define SYSON_S_BIT_HS_LPDDR1_EN                     ((u32)0x00000001 << 0)                              /*!<R/W 0  memory control function enable  */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_DDRPHY_CTRL
 * @brief                                            (@ 0X084)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_DFI_PLL_REF_TEST_MODE          10
#define SYSON_S_BIT_DFI_PLL_REF_TEST_MODE            ((u32)0x00000001 << 10)                             /*!<R/W 0  1:enable */
#define SYSON_S_SHIFT_DFI_PLL_TEST_MODE              9
#define SYSON_S_BIT_DFI_PLL_TEST_MODE                ((u32)0x00000001 << 9)                              /*!<R/W 0  1:enable */
#define SYSON_S_SHIFT_DFI_PLL_TEST_CKE               8
#define SYSON_S_BIT_DFI_PLL_TEST_CKE                 ((u32)0x00000001 << 8)                              /*!<R/W 0  1:enable */
#define SYSON_S_SHIFT_HS_DDRPHY_CRT_CLK_EN           7
#define SYSON_S_BIT_HS_DDRPHY_CRT_CLK_EN             ((u32)0x00000001 << 7)                              /*!<R/W 0  CRT control register clock gating control */
#define SYSON_S_SHIFT_HS_DDRPHY_RBUS_CLK_EN          6
#define SYSON_S_BIT_HS_DDRPHY_RBUS_CLK_EN            ((u32)0x00000001 << 6)                              /*!<R/W 0  Rbus interface clock gating control */
#define SYSON_S_SHIFT_DDRPHY_VCCON                   4
#define SYSON_S_BIT_DDRPHY_VCCON                     ((u32)0x00000001 << 4)                              /*!<R/W 0  1: enable core power */
#define SYSON_S_SHIFT_HS_DDRPHY_PLL_RDY              3
#define SYSON_S_BIT_HS_DDRPHY_PLL_RDY                ((u32)0x00000001 << 3)                              /*!<R 0  PLL ready */
#define SYSON_S_SHIFT_DDRPHY_RBUS_EN                 2
#define SYSON_S_BIT_DDRPHY_RBUS_EN                   ((u32)0x00000001 << 2)                              /*!<R/W 0  1: reset RBUS */
#define SYSON_S_SHIFT_PWDPAD15N                      1
#define SYSON_S_BIT_PWDPAD15N                        ((u32)0x00000001 << 1)                              /*!<R/W 0  0:RESET PAD pull high and CKE PAD pull low (DRAM into seif-refresh mode) */
#define SYSON_S_SHIFT_HS_DDRPHY_CRT_RST              0
#define SYSON_S_BIT_HS_DDRPHY_CRT_RST                ((u32)0x00000001 << 0)                              /*!<R/W 0  CRT active low asynchronous reset */
/** @} */

