Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_s_type.h
/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_FLASH_CTRL
 * @brief                                            (@ 0X08C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_NAND_FLASH_CLK_EN              6
#define SYSON_S_BIT_NAND_FLASH_CLK_EN                ((u32)0x00000001 << 6)                              /*!<R/W 0  1: Enable NAND FLASH CLK */
#define SYSON_S_SHIFT_NAND_FLASH_EN                  5
#define SYSON_S_BIT_NAND_FLASH_EN                    ((u32)0x00000001 << 5)                              /*!<R/W 0  1: Enable NAND FLASH */
#define SYSON_S_SHIFT_HS_FLASH_INIT_OK               4
#define SYSON_S_BIT_HS_FLASH_INIT_OK                 ((u32)0x00000001 << 4)                              /*!<R 0  BOOT_finish  */
#define SYSON_S_SHIFT_SYS_FLASH_SRC_SEL              2
#define SYSON_S_BIT_SYS_FLASH_SRC_SEL                ((u32)0x00000001 << 2)                              /*!<R/W 0  0: 250MHz, 1:200MHz */
#define SYSON_S_SHIFT_NOR_FLASH_CLK_EN               1
#define SYSON_S_BIT_NOR_FLASH_CLK_EN                 ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable NOR FLASH CLK */
#define SYSON_S_SHIFT_NOR_FLASH_EN                   0
#define SYSON_S_BIT_NOR_FLASH_EN                     ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable NOR FLASH */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_FLASH_PHY_CTRL0
 * @brief                                            (@ 0X090)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_FLASH_PHY_CLK_SEL              20
#define SYSON_S_BIT_FLASH_PHY_CLK_SEL                ((u32)0x00000001 << 20)                             /*!<R/W 0  1: SPIC phy use loopback clock through delay chain from PAD as fetch clk. 0: SPIC phy use spic controller clk trhough delay chain as fetch clk */
#define SYSON_S_SHIFT_FLASH_PHY_FETCH_PHASE          16
#define SYSON_S_MASK_FLASH_PHY_FETCH_PHASE           ((u32)0x0000000F << 16)                             /*!<R/W 0  [0]: delay 0.5 spic_clk period to fetch lower lane data [1]: delay 0.5 spic_clk period to fetch upper lane data [2]: delay 0.5 spic_clk period to sync lower lane data to spic [3]: delay 0.5 spic_clk period to sync upper lane data to spic */
#define SYSON_S_SHIFT_FLASH_PHY_MUX_SEL              7
#define SYSON_S_BIT_FLASH_PHY_MUX_SEL                ((u32)0x00000001 << 7)                              /*!<R/W 0  [0]:NOR FLASH [1]: NAND FLASH */
#define SYSON_S_SHIFT_FLASH_PHY_DLY_EN               5
#define SYSON_S_MASK_FLASH_PHY_DLY_EN                ((u32)0x00000003 << 5)                              /*!<R/W 0  [0]: delay lower lane a spic_clk period [1]: delay upper lane a spic_clk period */
#define SYSON_S_SHIFT_FLASH_PHY_DQS_DDR_EN           4
#define SYSON_S_BIT_FLASH_PHY_DQS_DDR_EN             ((u32)0x00000001 << 4)                              /*!<R/W 0  enable DQS to fetch double data rate rx data */
#define SYSON_S_SHIFT_FLASH_PHY_DQS_EN               3
#define SYSON_S_BIT_FLASH_PHY_DQS_EN                 ((u32)0x00000001 << 3)                              /*!<R/W 0  enable DQS to fetch rx data */
#define SYSON_S_SHIFT_FLASH_PHY_MERGE_PHASE_EN       2
#define SYSON_S_BIT_FLASH_PHY_MERGE_PHASE_EN         ((u32)0x00000001 << 2)                              /*!<R/W 0  0: posedge rx data first 1: negedge rx data first */
#define SYSON_S_SHIFT_FLASH_PHY_OUTPUT_PHASE_EN      1
#define SYSON_S_BIT_FLASH_PHY_OUTPUT_PHASE_EN        ((u32)0x00000001 << 1)                              /*!<R/W 0  delay 0.5 spic_clk period of sclk */
#define SYSON_S_SHIFT_FLASH_PHY_EN                   0
#define SYSON_S_BIT_FLASH_PHY_EN                     ((u32)0x00000001 << 0)                              /*!<R/W 0  enble rx data */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_FLASH_PHY_CTRL1
 * @brief                                            (@ 0X094)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_FLASH_PHY_DQSU_DLY_SEL         16
#define SYSON_S_MASK_FLASH_PHY_DQSU_DLY_SEL          ((u32)0x000000FF << 16)                             /*!<R/W 0  select delay level of DQS on the upper lane */
#define SYSON_S_SHIFT_FLASH_PHY_DQSL_DLY_SEL         8
#define SYSON_S_MASK_FLASH_PHY_DQSL_DLY_SEL          ((u32)0x000000FF << 8)                              /*!<R/W 0  select delay level of DQS on the lower lane */
#define SYSON_S_SHIFT_FLASH_PHY_OUTPUT_DLY_SEL       0
#define SYSON_S_MASK_FLASH_PHY_OUTPUT_DLY_SEL        ((u32)0x000000FF << 0)                              /*!<R/W 0  select delay level of sclk delay line  */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_PLATFORM_CTRL0
 * @brief                                            (@ 0X09C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_HS_TRNG_HI_CLK_SEL             27
#define SYSON_S_BIT_HS_TRNG_HI_CLK_SEL               ((u32)0x00000001 << 27)                             /*!<R/W 1  0: XTAL, 1: 40MHz */
#define SYSON_S_SHIFT_HS_TRNG_LOW_CLK_SEL            26
#define SYSON_S_BIT_HS_TRNG_LOW_CLK_SEL              ((u32)0x00000001 << 26)                             /*!<R/W 1  0: 32kHz, 1: 128kHz */
#define SYSON_S_SHIFT_HS_TRNG_CLK_EN                 25
#define SYSON_S_BIT_HS_TRNG_CLK_EN                   ((u32)0x00000001 << 25)                             /*!<R/W 0  1: TRNG clock enable */
#define SYSON_S_SHIFT_HS_TRNG_EN                     24
#define SYSON_S_BIT_HS_TRNG_EN                       ((u32)0x00000001 << 24)                             /*!<R/W 0  1: enable TRNG IP */
#define SYSON_S_SHIFT_HS_IPSEC_CLK_EN                23
#define SYSON_S_BIT_HS_IPSEC_CLK_EN                  ((u32)0x00000001 << 23)                             /*!<R/W 0  1: security engine clock enable */
#define SYSON_S_SHIFT_HS_IPSEC_EN                    22
#define SYSON_S_BIT_HS_IPSEC_EN                      ((u32)0x00000001 << 22)                             /*!<R/W 0  1: enable security engine IP */
#define SYSON_S_SHIFT_HS_ED255_CLK_EN                21
#define SYSON_S_BIT_HS_ED255_CLK_EN                  ((u32)0x00000001 << 21)                             /*!<R/W 0  1: ED25519 clock enable */
#define SYSON_S_SHIFT_HS_ED255_EN                    20
#define SYSON_S_BIT_HS_ED255_EN                      ((u32)0x00000001 << 20)                             /*!<R/W 0  1: enable ED25519 IP */
#define SYSON_S_SHIFT_HS_ECC_CLK_EN                  19
#define SYSON_S_BIT_HS_ECC_CLK_EN                    ((u32)0x00000001 << 19)                             /*!<R/W 0  1: ECC clock enable */
#define SYSON_S_SHIFT_HS_ECC_EN                      18
#define SYSON_S_BIT_HS_ECC_EN                        ((u32)0x00000001 << 18)                             /*!<R/W 0  1: enable ECC IP */
#define SYSON_S_SHIFT_LXBUS_CLK_EN                   17
#define SYSON_S_BIT_LXBUS_CLK_EN                     ((u32)0x00000001 << 17)                             /*!<R/W 0  1: Enable LX bus CLK */
#define SYSON_S_SHIFT_LXBUS_EN                       16
#define SYSON_S_BIT_LXBUS_EN                         ((u32)0x00000001 << 16)                             /*!<R/W 0  1: Enable LX bus */
#define SYSON_S_SHIFT_HS_GDMA1_CLK_ALWS_DIS          13
#define SYSON_S_BIT_HS_GDMA1_CLK_ALWS_DIS            ((u32)0x00000001 << 13)                             /*!<R/W 0  gdma_clk_always_disable */
#define SYSON_S_SHIFT_HS_GDMA1_CLK_ALWS_EN           12
#define SYSON_S_BIT_HS_GDMA1_CLK_ALWS_EN             ((u32)0x00000001 << 12)                             /*!<R/W 0  gdma_clk_always_enable */
#define SYSON_S_SHIFT_HS_GDMA1_CLK_EN                9
#define SYSON_S_BIT_HS_GDMA1_CLK_EN                  ((u32)0x00000001 << 9)                              /*!<R/W 0  1: Enable GDMA1 CLK */
#define SYSON_S_SHIFT_HS_GDMA1_EN                    8
#define SYSON_S_BIT_HS_GDMA1_EN                      ((u32)0x00000001 << 8)                              /*!<R/W 0  1: Enable GDMA1 */
#define SYSON_S_SHIFT_HS_GDMA0_CLK_ALWS_DIS          5
#define SYSON_S_BIT_HS_GDMA0_CLK_ALWS_DIS            ((u32)0x00000001 << 5)                              /*!<R/W 0  gdma_clk_always_disable */
#define SYSON_S_SHIFT_HS_GDMA0_CLK_ALWS_EN           4
#define SYSON_S_BIT_HS_GDMA0_CLK_ALWS_EN             ((u32)0x00000001 << 4)                              /*!<R/W 0  gdma_clk_always_enable */
#define SYSON_S_SHIFT_HS_GDMA0_CLK_EN                1
#define SYSON_S_BIT_HS_GDMA0_CLK_EN                  ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable GDMA0 CLK */
#define SYSON_S_SHIFT_HS_GDMA0_EN                    0
#define SYSON_S_BIT_HS_GDMA0_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable GDMA0 */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_FEPHY_CTRL
 * @brief                                            (@ 0X100)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_PHY_AD                         8
#define SYSON_S_MASK_PHY_AD                          ((u32)0x0000001F << 8)                              /*!<R/W 1  phy address */
#define SYSON_S_SHIFT_REF_PORB_DV_CEL_L              7
#define SYSON_S_BIT_REF_PORB_DV_CEL_L                ((u32)0x00000001 << 7)                              /*!<R 0  detecting digital core power lower than ref */
#define SYSON_S_SHIFT_REF_PORB_AV_CEL_L              6
#define SYSON_S_BIT_REF_PORB_AV_CEL_L                ((u32)0x00000001 << 6)                              /*!<R 0  detecting analog core power lower than ref */
#define SYSON_S_SHIFT_REF_AVTH_CEL_H                 4
#define SYSON_S_MASK_REF_AVTH_CEL_H                  ((u32)0x00000003 << 4)                              /*!<R/W 11  analog core power threshold adjust */
#define SYSON_S_SHIFT_REF_AVTH_CEL_L                 2
#define SYSON_S_MASK_REF_AVTH_CEL_L                  ((u32)0x00000003 << 2)                              /*!<R/W 11  analog core power threshold adjust */
#define SYSON_S_SHIFT_REF_PORB_ANA_CELL_L            0
#define SYSON_S_BIT_REF_PORB_ANA_CELL_L              ((u32)0x00000001 << 0)                              /*!<R 0  debug signal */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_TIMER_CTRL
 * @brief                                            (@ 0X104)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_TG3_SRC_SEL                21
#define SYSON_S_MASK_SYS_TG3_SRC_SEL                 ((u32)0x00000003 << 21)                             /*!<R/W 10  00: 32kHz 01: 4MHz 10: 31.25MHz 11: rsvd */
#define SYSON_S_SHIFT_SYS_TG3_INTR_CLK_SEL           20
#define SYSON_S_BIT_SYS_TG3_INTR_CLK_SEL             ((u32)0x00000001 << 20)                             /*!<R/W 0  Select TC1 interrupt clock source, 0: APB clock, 1: timer counter clock (controlled by BIT_TG3_SCLK_SEL[1:0]) */
#define SYSON_S_SHIFT_SYS_TG3_SCLK_EN                19
#define SYSON_S_BIT_SYS_TG3_SCLK_EN                  ((u32)0x00000001 << 19)                             /*!<R/W 0  1: Enable SYS Timer Group3 Sclock */
#define SYSON_S_SHIFT_SYS_TG3_PCLK_EN                18
#define SYSON_S_BIT_SYS_TG3_PCLK_EN                  ((u32)0x00000001 << 18)                             /*!<R/W 0  1: Enable SYS Timer Group3 Pclock */
#define SYSON_S_SHIFT_SYS_TG3_EN                     17
#define SYSON_S_BIT_SYS_TG3_EN                       ((u32)0x00000001 << 17)                             /*!<R/W 0  1: Enable SYS Timer Group3 block */
#define SYSON_S_SHIFT_SYS_TG2_SRC_SEL                12
#define SYSON_S_MASK_SYS_TG2_SRC_SEL                 ((u32)0x00000003 << 12)                             /*!<R/W 10  00: 32kHz 01: 4MHz 10: 31.25MHz 11: rsvd */
#define SYSON_S_SHIFT_SYS_TG2_INTR_CLK_SEL           11
#define SYSON_S_BIT_SYS_TG2_INTR_CLK_SEL             ((u32)0x00000001 << 11)                             /*!<R/W 0  Select TC1 interrupt clock source, 0: APB clock, 1: timer counter clock (controlled by BIT_TG2_SCLK_SEL[1:0]) */
#define SYSON_S_SHIFT_SYS_TG2_SCLK_EN                10
#define SYSON_S_BIT_SYS_TG2_SCLK_EN                  ((u32)0x00000001 << 10)                             /*!<R/W 0  1: Enable SYS Timer Group2 Sclock */
#define SYSON_S_SHIFT_SYS_TG2_PCLK_EN                9
#define SYSON_S_BIT_SYS_TG2_PCLK_EN                  ((u32)0x00000001 << 9)                              /*!<R/W 0  1: Enable SYS Timer Group2 Pclock */
#define SYSON_S_SHIFT_SYS_TG2_EN                     8
#define SYSON_S_BIT_SYS_TG2_EN                       ((u32)0x00000001 << 8)                              /*!<R/W 0  1: Enable SYS Timer Group2 block */
#define SYSON_S_SHIFT_SYS_TG1_SRC_SEL                4
#define SYSON_S_MASK_SYS_TG1_SRC_SEL                 ((u32)0x00000003 << 4)                              /*!<R/W 10  00: 32kHz 01: 4MHz 10: 31.25MHz 11: rsvd */
#define SYSON_S_SHIFT_SYS_TG1_INTR_CLK_SEL           3
#define SYSON_S_BIT_SYS_TG1_INTR_CLK_SEL             ((u32)0x00000001 << 3)                              /*!<R/W 0  select TG1 interrupt clock source, 0: APB clock, 1: timer counter clock (controlled by BIT_TG1_SCLK_SEL[1:0]) */
#define SYSON_S_SHIFT_SYS_TG1_SCLK_EN                2
#define SYSON_S_BIT_SYS_TG1_SCLK_EN                  ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable SYS Timer Group1 Sclock */
#define SYSON_S_SHIFT_SYS_TG1_PCLK_EN                1
#define SYSON_S_BIT_SYS_TG1_PCLK_EN                  ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable SYS Timer Group1 Pclock */
#define SYSON_S_SHIFT_SYS_TG1_EN                     0
#define SYSON_S_BIT_SYS_TG1_EN                       ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable SYS Timer Group1 block */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_ADC_CTRL0
 * @brief                                            (@ 0X108)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_DUMMY_0                        24
#define SYSON_S_MASK_DUMMY_0                         ((u32)0x000000FF << 24)                             /*!<R/W 00000000   */
#define SYSON_S_SHIFT_BYPASSEN                       16
#define SYSON_S_MASK_BYPASSEN                        ((u32)0x000000FF << 16)                             /*!<R/W 00000000  1:1V mode, 0: 3.3V mode */
#define SYSON_S_SHIFT_DUMMY_1                        14
#define SYSON_S_MASK_DUMMY_1                         ((u32)0x00000003 << 14)                             /*!<R/W 00   */
#define SYSON_S_SHIFT_REG_VCM_SEL                    12
#define SYSON_S_MASK_REG_VCM_SEL                     ((u32)0x00000003 << 12)                             /*!<R/W 00  00/01/10/11 0.45/0.4375/0.425/0.4125V */
#define SYSON_S_SHIFT_SEL_LNA                        11
#define SYSON_S_BIT_SEL_LNA                          ((u32)0x00000001 << 11)                             /*!<R/W 1  1: comparator low noise for ALL bit */
#define SYSON_S_SHIFT_SEL_LN                         10
#define SYSON_S_BIT_SEL_LN                           ((u32)0x00000001 << 10)                             /*!<R/W 1  1: comparator low noise for LSB 6bit */
#define SYSON_S_SHIFT_REG_META                       9
#define SYSON_S_BIT_REG_META                         ((u32)0x00000001 << 9)                              /*!<R/W 0  1: enable meta detect */
#define SYSON_S_SHIFT_REG_CMPDEC                     7
#define SYSON_S_MASK_REG_CMPDEC                      ((u32)0x00000003 << 7)                              /*!<R/W 01  meta detect time 00: short */
#define SYSON_S_SHIFT_REG_REV_CLK                    6
#define SYSON_S_BIT_REG_REV_CLK                      ((u32)0x00000001 << 6)                              /*!<R/W 0  1: rever ckdata */
#define SYSON_S_SHIFT_REG_VREF_SEL                   4
#define SYSON_S_MASK_REG_VREF_SEL                    ((u32)0x00000003 << 4)                              /*!<R/W 00  00:0.9V 01:0.95V 10:1V 11:1.05V */
#define SYSON_S_SHIFT_REG_DELAY                      3
#define SYSON_S_BIT_REG_DELAY                        ((u32)0x00000001 << 3)                              /*!<R/W 0  clk delay */
#define SYSON_S_SHIFT_REG_CK                         2
#define SYSON_S_BIT_REG_CK                           ((u32)0x00000001 << 2)                              /*!<R/W 0  1: clk from external */
#define SYSON_S_SHIFT_POW_REF                        1
#define SYSON_S_BIT_POW_REF                          ((u32)0x00000001 << 1)                              /*!<R/W 0  pow adc refgen */
#define SYSON_S_SHIFT_POW                            0
#define SYSON_S_BIT_POW                              ((u32)0x00000001 << 0)                              /*!<R/W 0  pow adc */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_ADC_CTRL1
 * @brief                                            (@ 0X10C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_ADC_CTRL_MSR_SEL           5
#define SYSON_S_BIT_SYS_ADC_CTRL_MSR_SEL             ((u32)0x00000001 << 5)                              /*!<R/W 0  0: HW; 1:SW */
#define SYSON_S_SHIFT_SYS_ADC_INTR_CK_SEL            4
#define SYSON_S_BIT_SYS_ADC_INTR_CK_SEL              ((u32)0x00000001 << 4)                              /*!<R/W 0  0: pclk; 1: sclk */
#define SYSON_S_SHIFT_SYS_ISO_ADC                    3
#define SYSON_S_BIT_SYS_ISO_ADC                      ((u32)0x00000001 << 3)                              /*!<R/W 1  1: isolation ADC analog to digital domain; 0: disable isolation */
#define SYSON_S_SHIFT_SYS_ADC_SCLK_EN                2
#define SYSON_S_BIT_SYS_ADC_SCLK_EN                  ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable SYS ADC Sclock */
#define SYSON_S_SHIFT_SYS_ADC_PCLK_EN                1
#define SYSON_S_BIT_SYS_ADC_PCLK_EN                  ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable SYS ADC Pclock */
#define SYSON_S_SHIFT_SYS_ADC_EN                     0
#define SYSON_S_BIT_SYS_ADC_EN                       ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable SYS ADC block */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_GPIO_CTRL
 * @brief                                            (@ 0X110)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_GPIO_INTR_CLK_SEL          3
#define SYSON_S_BIT_SYS_GPIO_INTR_CLK_SEL            ((u32)0x00000001 << 3)                              /*!<R/W 0  0: APB, 1: debounce clock */
#define SYSON_S_SHIFT_SYS_GPIO_SCLK_EN               2
#define SYSON_S_BIT_SYS_GPIO_SCLK_EN                 ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable SYS GPIO Sclock */
#define SYSON_S_SHIFT_SYS_GPIO_PCLK_EN               1
#define SYSON_S_BIT_SYS_GPIO_PCLK_EN                 ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable SYS GPIO Pclock */
#define SYSON_S_SHIFT_SYS_GPIO_EN                    0
#define SYSON_S_BIT_SYS_GPIO_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable SYS GPIO block */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_AUDIO_CTRL
 * @brief                                            (@ 0X114)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_SPORT_CODEC_SEL            20
#define SYSON_S_BIT_SYS_SPORT_CODEC_SEL              ((u32)0x00000001 << 20)                             /*!<R/W 0  Codec Select 0: Internal Codec 1: External Codec */
#define SYSON_S_SHIFT_SYS_CODEC_LDO_TUNE             13
#define SYSON_S_MASK_SYS_CODEC_LDO_TUNE              ((u32)0x0000007F << 13)                             /*!<R/W 1011111   */
#define SYSON_S_SHIFT_SYS_CODEC_LDO_EN               12
#define SYSON_S_BIT_SYS_CODEC_LDO_EN                 ((u32)0x00000001 << 12)                             /*!<R/W 0  LDO power control 0: disable LDO 1: enable LDO */
#define SYSON_S_SHIFT_SYS_CODEC_PORB                 11
#define SYSON_S_BIT_SYS_CODEC_PORB                   ((u32)0x00000001 << 11)                             /*!<R/W 0  0: power down codec */
#define SYSON_S_SHIFT_SYS_CODEC_SCLK_EN              10
#define SYSON_S_BIT_SYS_CODEC_SCLK_EN                ((u32)0x00000001 << 10)                             /*!<R/W 0  1: enable codec Sclock */
#define SYSON_S_SHIFT_SYS_CODEC_EN                   8
#define SYSON_S_BIT_SYS_CODEC_EN                     ((u32)0x00000001 << 8)                              /*!<R/W 0  1: enable codec IP */
#define SYSON_S_SHIFT_SYS_SI_SCLK_EN                 7
#define SYSON_S_BIT_SYS_SI_SCLK_EN                   ((u32)0x00000001 << 7)                              /*!<R/W 0  1: enable si Sclock */
#define SYSON_S_SHIFT_SYS_SI_PCLK_EN                 6
#define SYSON_S_BIT_SYS_SI_PCLK_EN                   ((u32)0x00000001 << 6)                              /*!<R/W 0  1: enable si Pclock */
#define SYSON_S_SHIFT_SYS_SI_EN                      5
#define SYSON_S_BIT_SYS_SI_EN                        ((u32)0x00000001 << 5)                              /*!<R/W 0  1: enable si IP */
#define SYSON_S_SHIFT_SYS_SPORT_SRC_SEL              3
#define SYSON_S_MASK_SYS_SPORT_SRC_SEL               ((u32)0x00000003 << 3)                              /*!<R/W 00  00: 40MHz 01: 98.304kHz 10: 45.158kHz 11: rsvd */
#define SYSON_S_SHIFT_SYS_SPORT_SCLK_EN              2
#define SYSON_S_BIT_SYS_SPORT_SCLK_EN                ((u32)0x00000001 << 2)                              /*!<R/W 0  1: enable sport Sclock */
#define SYSON_S_SHIFT_SYS_SPORT_PCLK_EN              1
#define SYSON_S_BIT_SYS_SPORT_PCLK_EN                ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable sport Pclock */
#define SYSON_S_SHIFT_SYS_SPORT_EN                   0
#define SYSON_S_BIT_SYS_SPORT_EN                     ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable sport IP */
/** @} */

