Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_s_type.h
/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_ISP_CTRL
 * @brief                                            (@ 0X118)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_ISP_DBG_SEL                16
#define SYSON_S_MASK_SYS_ISP_DBG_SEL                 ((u32)0x0000003F << 16)                             /*!<R/W 0  select ISP dbg mux */
#define SYSON_S_SHIFT_SYS_VOE_CLK_EN                 13
#define SYSON_S_BIT_SYS_VOE_CLK_EN                   ((u32)0x00000001 << 13)                             /*!<R/W 0  1: Enable VOE CLK */
#define SYSON_S_SHIFT_SYS_VOE_EN                     12
#define SYSON_S_BIT_SYS_VOE_EN                       ((u32)0x00000001 << 12)                             /*!<R/W 0  1: Enable VOE */
#define SYSON_S_SHIFT_SYS_ENCODER_SRC_SEL            10
#define SYSON_S_MASK_SYS_ENCODER_SRC_SEL             ((u32)0x00000003 << 10)                             /*!<R/W 01  00: 166.6MHz 01: 125MHz 10: 100MHz 11: rsvd */
#define SYSON_S_SHIFT_SYS_ENCODER_CLK_EN             9
#define SYSON_S_BIT_SYS_ENCODER_CLK_EN               ((u32)0x00000001 << 9)                              /*!<R/W 0  1: Enable Encoder CLK */
#define SYSON_S_SHIFT_SYS_ENCODER_EN                 8
#define SYSON_S_BIT_SYS_ENCODER_EN                   ((u32)0x00000001 << 8)                              /*!<R/W 0  1: Enable Encoder */
#define SYSON_S_SHIFT_SYS_MIPI_SRC_SEL               5
#define SYSON_S_MASK_SYS_MIPI_SRC_SEL                ((u32)0x00000007 << 5)                              /*!<R/W 000  000: 250MHz 001: 200MHz 010: 166.6MHz 011: 125MHz 100: 100MHz 101: 83.3MHz 110: rsvd 111: rsvd */
#define SYSON_S_SHIFT_SYS_ISP_SRC_SEL                2
#define SYSON_S_MASK_SYS_ISP_SRC_SEL                 ((u32)0x00000007 << 2)                              /*!<R/W 000  000: 200MHz 001: 166.6MHz 010: 125MHz 011: 100MHz 100: 83.3MHz 101: rsvd 110: rsvd 111: rsvd */
#define SYSON_S_SHIFT_SYS_ISP_CLK_EN                 1
#define SYSON_S_BIT_SYS_ISP_CLK_EN                   ((u32)0x00000001 << 1)                              /*!<R/W 0  1. Enable ISP CLK */
#define SYSON_S_SHIFT_SYS_ISP_EN                     0
#define SYSON_S_BIT_SYS_ISP_EN                       ((u32)0x00000001 << 0)                              /*!<R/W 0  1. Enable ISP */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_NN_CTRL
 * @brief                                            (@ 0X11C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_NN_SRC_SEL                 3
#define SYSON_S_MASK_SYS_NN_SRC_SEL                  ((u32)0x00000003 << 3)                              /*!<R/W 0  0: 500MHz 1: 400MHz 2: 250MHz */
#define SYSON_S_SHIFT_SYS_NN_CLK_EN                  1
#define SYSON_S_BIT_SYS_NN_CLK_EN                    ((u32)0x00000001 << 1)                              /*!<R/W 0  1. Enable NN CLK */
#define SYSON_S_SHIFT_SYS_NN_EN                      0
#define SYSON_S_BIT_SYS_NN_EN                        ((u32)0x00000001 << 0)                              /*!<R/W 0  1. Enable NN */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_OTG_CTRL
 * @brief                                            (@ 0X120)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_USBPHY_XTAL_SEL                30
#define SYSON_S_BIT_USBPHY_XTAL_SEL                  ((u32)0x00000001 << 30)                             /*!<R/W 0  0:Analog XTAL, 1:Digital XTAL */
#define SYSON_S_SHIFT_USBPHY_CKREF_SEL               26
#define SYSON_S_MASK_USBPHY_CKREF_SEL                ((u32)0x0000000F << 26)                             /*!<R/W 0  0000: 40MHz 0001: 25MHz 0010: 54MHz 0011: 19.2MHz 0100: 20MHz 0101: 26MHz */
#define SYSON_S_SHIFT_SYS_ISO_USBA_EN                25
#define SYSON_S_BIT_SYS_ISO_USBA_EN                  ((u32)0x00000001 << 25)                             /*!<R/W 1  1: enable usb analogy isolation */
#define SYSON_S_SHIFT_SYS_ISO_USBD_EN                24
#define SYSON_S_BIT_SYS_ISO_USBD_EN                  ((u32)0x00000001 << 24)                             /*!<R/W 1  1: enable usb digital isolation */
#define SYSON_S_SHIFT_USB_IBX2MIPI_EN                22
#define SYSON_S_BIT_USB_IBX2MIPI_EN                  ((u32)0x00000001 << 22)                             /*!<R/W 0  1: Enable IBX to MIPI, DDR and EPHY */
#define SYSON_S_SHIFT_USB_IBX2USB_EN                 21
#define SYSON_S_BIT_USB_IBX2USB_EN                   ((u32)0x00000001 << 21)                             /*!<R/W 0  1: Enable IBX to USB */
#define SYSON_S_SHIFT_USB_PDN33                      20
#define SYSON_S_BIT_USB_PDN33                        ((u32)0x00000001 << 20)                             /*!<R/W 1  1: power up USB */
#define SYSON_S_SHIFT_SYS_UABG_EN                    19
#define SYSON_S_BIT_SYS_UABG_EN                      ((u32)0x00000001 << 19)                             /*!<R/W 0  1. Enable bandgap */
#define SYSON_S_SHIFT_SYS_UAHV_EN                    18
#define SYSON_S_BIT_SYS_UAHV_EN                      ((u32)0x00000001 << 18)                             /*!<R/W 0  1: USB PHY analog 3.3V power cut enable */
#define SYSON_S_SHIFT_SYS_USBD_EN                    16
#define SYSON_S_BIT_SYS_USBD_EN                      ((u32)0x00000001 << 16)                             /*!<R/W 0  1: USB Digital power cut enable (USB PHY analog 1.2V power cut enable) */
#define SYSON_S_SHIFT_SYS_OTG_UTMI_CLK_EN            5
#define SYSON_S_BIT_SYS_OTG_UTMI_CLK_EN              ((u32)0x00000001 << 5)                              /*!<R/W 0  1: OTG utmi enable */
#define SYSON_S_SHIFT_SYS_OTG_CLK_EN                 4
#define SYSON_S_BIT_SYS_OTG_CLK_EN                   ((u32)0x00000001 << 4)                              /*!<R/W 0  1: OTG bus clock enable */
#define SYSON_S_SHIFT_SYS__LPM_PLL_ALIVE             3
#define SYSON_S_BIT_SYS__LPM_PLL_ALIVE               ((u32)0x00000001 << 3)                              /*!<R/W 0  1: Keep utmi clock active during suspend state */
#define SYSON_S_SHIFT_SYS_OTG_RST_MUX                1
#define SYSON_S_BIT_SYS_OTG_RST_MUX                  ((u32)0x00000001 << 1)                              /*!<R/W 0  0: Mask WDOG_RST and "cpu_r0_rst" for OTG */
#define SYSON_S_SHIFT_SYS_OTG_EN                     0
#define SYSON_S_BIT_SYS_OTG_EN                       ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable OTG IP */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_SDIO_SD_CTRL
 * @brief                                            (@ 0X124)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_SD_CK100_VP1_RDY           26
#define SYSON_S_BIT_SYS_SD_CK100_VP1_RDY             ((u32)0x00000001 << 26)                             /*!<R 0  sdh_clk100m_vp1 clock ready */
#define SYSON_S_SHIFT_SYS_SD_CK100_VP0_RDY           25
#define SYSON_S_BIT_SYS_SD_CK100_VP0_RDY             ((u32)0x00000001 << 25)                             /*!<R 0  sdh_clk100m_vp0 clock ready */
#define SYSON_S_SHIFT_SYS_SD_CK100_RDY               24
#define SYSON_S_BIT_SYS_SD_CK100_RDY                 ((u32)0x00000001 << 24)                             /*!<R 0  sdh_clk100m clock ready */
#define SYSON_S_SHIFT_SD_PLL_BYPASS_MODE             23
#define SYSON_S_BIT_SD_PLL_BYPASS_MODE               ((u32)0x00000001 << 23)                             /*!<R/W 0  0: Use Internal clock, 1: Use tester clock */
#define SYSON_S_SHIFT_SYS_SD_CLK2_PSYSEL             20
#define SYSON_S_MASK_SYS_SD_CLK2_PSYSEL              ((u32)0x00000003 << 20)                             /*!<R/W 0  clk100m_vp1 phase shift selection (shift from clk100m) 2'b00 :shift 0 degree 2'b01 :shift 90 degree 2'b10 :shift 180 degree 2'b11 :shift 270 degree */
#define SYSON_S_SHIFT_SYS_SD_CLK1_PSYSEL             16
#define SYSON_S_MASK_SYS_SD_CLK1_PSYSEL              ((u32)0x00000003 << 16)                             /*!<R/W 0  clk100m_vp0 phase shift selection (shift from clk100m) 2'b00 :shift 0 degree 2'b01 :shift 90 degree 2'b10 :shift 180 degree 2'b11 :shift 270 degree */
#define SYSON_S_SHIFT_SYS_SD_ON_RST_MUX              12
#define SYSON_S_BIT_SYS_SD_ON_RST_MUX                ((u32)0x00000001 << 12)                             /*!<R/W 0  0: Mask WDOG_RST and "cpu_r0_rst" for SD ON */
#define SYSON_S_SHIFT_SYS_SD_SYST_SCLK_EN            11
#define SYSON_S_BIT_SYS_SD_SYST_SCLK_EN              ((u32)0x00000001 << 11)                             /*!<R/W 0  1: Enable SD host SCLK */
#define SYSON_S_SHIFT_SYS_SD_SYST_100M_EN            10
#define SYSON_S_BIT_SYS_SD_SYST_100M_EN              ((u32)0x00000001 << 10)                             /*!<R/W 0  SD 100Mhz clock generator function enable */
#define SYSON_S_SHIFT_SYS_SD_SYST_PCLK_EN            9
#define SYSON_S_BIT_SYS_SD_SYST_PCLK_EN              ((u32)0x00000001 << 9)                              /*!<R/W 0  1: enable SD SYST pclock */
#define SYSON_S_SHIFT_SYS_SDH_EN                     8
#define SYSON_S_BIT_SYS_SDH_EN                       ((u32)0x00000001 << 8)                              /*!<R/W 0  1: enable SD host IP block */
#define SYSON_S_SHIFT_SYS_SDIOD_ON_RST_MUX           4
#define SYSON_S_BIT_SYS_SDIOD_ON_RST_MUX             ((u32)0x00000001 << 4)                              /*!<R/W 0  0: Mask WDOG_RST and "cpu_r0_rst" for SDIO */
#define SYSON_S_SHIFT_SDIO_PLL_BYPASS_MODE           2
#define SYSON_S_BIT_SDIO_PLL_BYPASS_MODE             ((u32)0x00000001 << 2)                              /*!<R/W 0  0: Use Internal clock, 1: Use tester clock */
#define SYSON_S_SHIFT_SYS_SDIO_HOST_CLK_EN           1
#define SYSON_S_BIT_SYS_SDIO_HOST_CLK_EN             ((u32)0x00000001 << 1)                              /*!<R/W 0  1: enable SDIO Host clock */
#define SYSON_S_SHIFT_SYS_SDIOD_HOST_EN              0
#define SYSON_S_BIT_SYS_SDIOD_HOST_EN                ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable SDIO Host IP block */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_RMII_CTRL
 * @brief                                            (@ 0X128)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_RMII_SCLK_GEN              2
#define SYSON_S_BIT_SYS_RMII_SCLK_GEN                ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable RMII 50MHz */
#define SYSON_S_SHIFT_SYS_RMII_CLK_EN                1
#define SYSON_S_BIT_SYS_RMII_CLK_EN                  ((u32)0x00000001 << 1)                              /*!<R/W 0  1: RMII clock enable */
#define SYSON_S_SHIFT_SYS_RMII_EN                    0
#define SYSON_S_BIT_SYS_RMII_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: enable RMII IP */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_UART_CTRL
 * @brief                                            (@ 0X12C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_BT_UART_MUX_EN             28
#define SYSON_S_BIT_SYS_BT_UART_MUX_EN               ((u32)0x00000001 << 28)                             /*!<R/W 0  1: BT_UART to internal BT, 0: Pinmux to internal BT */
#define SYSON_S_SHIFT_SYS_BT_UART_SCLK_EN            27
#define SYSON_S_BIT_SYS_BT_UART_SCLK_EN              ((u32)0x00000001 << 27)                             /*!<R/W 0  1: Enable BT_UART SCLK */
#define SYSON_S_SHIFT_SYS_BT_UART_PCLK_EN            26
#define SYSON_S_BIT_SYS_BT_UART_PCLK_EN              ((u32)0x00000001 << 26)                             /*!<R/W 0  1: Enable BT_UART PCLK */
#define SYSON_S_SHIFT_SYS_BT_UART_BD_EN              25
#define SYSON_S_BIT_SYS_BT_UART_BD_EN                ((u32)0x00000001 << 25)                             /*!<R/W 0  1: Enable BT_UART bus domain */
#define SYSON_S_SHIFT_SYS_BT_UART_EN                 24
#define SYSON_S_BIT_SYS_BT_UART_EN                   ((u32)0x00000001 << 24)                             /*!<R/W 0  1: Enable BT_UART  */
#define SYSON_S_SHIFT_SYS_UART3_SCLK_EN              19
#define SYSON_S_BIT_SYS_UART3_SCLK_EN                ((u32)0x00000001 << 19)                             /*!<R/W 0  1: Enable UART3 SCLK */
#define SYSON_S_SHIFT_SYS_UART3_PCLK_EN              18
#define SYSON_S_BIT_SYS_UART3_PCLK_EN                ((u32)0x00000001 << 18)                             /*!<R/W 0  1: Enable UART3 PCLK */
#define SYSON_S_SHIFT_SYS_UART3_BD_EN                17
#define SYSON_S_BIT_SYS_UART3_BD_EN                  ((u32)0x00000001 << 17)                             /*!<R/W 0  1: Enable UART3 bus domain */
#define SYSON_S_SHIFT_SYS_UART3_EN                   16
#define SYSON_S_BIT_SYS_UART3_EN                     ((u32)0x00000001 << 16)                             /*!<R/W 0  1: Enable UART3  */
#define SYSON_S_SHIFT_SYS_UART2_SCLK_EN              11
#define SYSON_S_BIT_SYS_UART2_SCLK_EN                ((u32)0x00000001 << 11)                             /*!<R/W 0  1: Enable UART2 SCLK */
#define SYSON_S_SHIFT_SYS_UART2_PCLK_EN              10
#define SYSON_S_BIT_SYS_UART2_PCLK_EN                ((u32)0x00000001 << 10)                             /*!<R/W 0  1: Enable UART2 PCLK */
#define SYSON_S_SHIFT_SYS_UART2_BD_EN                9
#define SYSON_S_BIT_SYS_UART2_BD_EN                  ((u32)0x00000001 << 9)                              /*!<R/W 0  1: Enable UART2 bus domain */
#define SYSON_S_SHIFT_SYS_UART2_EN                   8
#define SYSON_S_BIT_SYS_UART2_EN                     ((u32)0x00000001 << 8)                              /*!<R/W 0  1: Enable UART2  */
#define SYSON_S_SHIFT_SYS_UART1_SCLK_EN              3
#define SYSON_S_BIT_SYS_UART1_SCLK_EN                ((u32)0x00000001 << 3)                              /*!<R/W 0  1: Enable UART1 SCLK */
#define SYSON_S_SHIFT_SYS_UART1_PCLK_EN              2
#define SYSON_S_BIT_SYS_UART1_PCLK_EN                ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable UART1 PCLK */
#define SYSON_S_SHIFT_SYS_UART1_BD_EN                1
#define SYSON_S_BIT_SYS_UART1_BD_EN                  ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable UART1 bus domain */
#define SYSON_S_SHIFT_SYS_UART1_EN                   0
#define SYSON_S_BIT_SYS_UART1_EN                     ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable UART1  */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_I2C_CTRL
 * @brief                                            (@ 0X130)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_I2C3_SCLK_EN               24
#define SYSON_S_BIT_SYS_I2C3_SCLK_EN                 ((u32)0x00000001 << 24)                             /*!<R/W 0  1: Enable I2C3 SCLK */
#define SYSON_S_SHIFT_SYS_I2C3_PCLK_EN               23
#define SYSON_S_BIT_SYS_I2C3_PCLK_EN                 ((u32)0x00000001 << 23)                             /*!<R/W 0  1: Enable I2C3 PCLK */
#define SYSON_S_SHIFT_SYS_I2C3_EN                    22
#define SYSON_S_BIT_SYS_I2C3_EN                      ((u32)0x00000001 << 22)                             /*!<R/W 0  1: Enable I2C3  */
#define SYSON_S_SHIFT_SYS_I2C2_SCLK_EN               21
#define SYSON_S_BIT_SYS_I2C2_SCLK_EN                 ((u32)0x00000001 << 21)                             /*!<R/W 0  1: Enable I2C2 SCLK */
#define SYSON_S_SHIFT_SYS_I2C2_PCLK_EN               20
#define SYSON_S_BIT_SYS_I2C2_PCLK_EN                 ((u32)0x00000001 << 20)                             /*!<R/W 0  1: Enable I2C2 PCLK */
#define SYSON_S_SHIFT_SYS_I2C2_EN                    19
#define SYSON_S_BIT_SYS_I2C2_EN                      ((u32)0x00000001 << 19)                             /*!<R/W 0  1: Enable I2C2  */
#define SYSON_S_SHIFT_SYS_I2C1_SCLK_EN               18
#define SYSON_S_BIT_SYS_I2C1_SCLK_EN                 ((u32)0x00000001 << 18)                             /*!<R/W 0  1: Enable I2C1 SCLK */
#define SYSON_S_SHIFT_SYS_I2C1_PCLK_EN               17
#define SYSON_S_BIT_SYS_I2C1_PCLK_EN                 ((u32)0x00000001 << 17)                             /*!<R/W 0  1: Enable I2C1 PCLK */
#define SYSON_S_SHIFT_SYS_I2C1_EN                    16
#define SYSON_S_BIT_SYS_I2C1_EN                      ((u32)0x00000001 << 16)                             /*!<R/W 0  1: Enable I2C1  */
#define SYSON_S_SHIFT_SYS_I2C0_SCLK_EN               2
#define SYSON_S_BIT_SYS_I2C0_SCLK_EN                 ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable I2C0 SCLK */
#define SYSON_S_SHIFT_SYS_I2C0_PCLK_EN               1
#define SYSON_S_BIT_SYS_I2C0_PCLK_EN                 ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable I2C0 PCLK */
#define SYSON_S_SHIFT_SYS_I2C0_EN                    0
#define SYSON_S_BIT_SYS_I2C0_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable I2C0  */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_SPI_CTRL
 * @brief                                            (@ 0X134)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_HS_SPI1_CLK_EN             7
#define SYSON_S_BIT_SYS_HS_SPI1_CLK_EN               ((u32)0x00000001 << 7)                              /*!<R/W 0  1: Enable HS SPI1 CLK */
#define SYSON_S_SHIFT_SYS_HS_SPI1_EN                 6
#define SYSON_S_BIT_SYS_HS_SPI1_EN                   ((u32)0x00000001 << 6)                              /*!<R/W 0  1: Enable HS SPI1  */
#define SYSON_S_SHIFT_SYS_HS_SPI0_CLK_EN             5
#define SYSON_S_BIT_SYS_HS_SPI0_CLK_EN               ((u32)0x00000001 << 5)                              /*!<R/W 0  1: Enable HS SPI0 CLK */
#define SYSON_S_SHIFT_SYS_HS_SPI0_EN                 4
#define SYSON_S_BIT_SYS_HS_SPI0_EN                   ((u32)0x00000001 << 4)                              /*!<R/W 0  1: Enable HS SPI0  */
#define SYSON_S_SHIFT_SYS_SPI1_CLK_EN                3
#define SYSON_S_BIT_SYS_SPI1_CLK_EN                  ((u32)0x00000001 << 3)                              /*!<R/W 0  1: Enable SPI1 CLK */
#define SYSON_S_SHIFT_SYS_SPI1_EN                    2
#define SYSON_S_BIT_SYS_SPI1_EN                      ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable SPI1  */
#define SYSON_S_SHIFT_SYS_SPI0_CLK_EN                1
#define SYSON_S_BIT_SYS_SPI0_CLK_EN                  ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable SPI0 CLK */
#define SYSON_S_SHIFT_SYS_SPI0_EN                    0
#define SYSON_S_BIT_SYS_SPI0_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable SPI0  */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_SYS_I2S_CTRL
 * @brief                                            (@ 0X138)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_SYS_SGPIO0_INT_CLK_SEL         7
#define SYSON_S_BIT_SYS_SGPIO0_INT_CLK_SEL           ((u32)0x00000001 << 7)                              /*!<R/W 0  1: sclk 0: apb0 */
#define SYSON_S_SHIFT_SYS_SGPIO0_SCLK_EN             6
#define SYSON_S_BIT_SYS_SGPIO0_SCLK_EN               ((u32)0x00000001 << 6)                              /*!<R/W 0  1: Enable SGPIO0 SCLK */
#define SYSON_S_SHIFT_SYS_SGPIO0_PCLK_EN             5
#define SYSON_S_BIT_SYS_SGPIO0_PCLK_EN               ((u32)0x00000001 << 5)                              /*!<R/W 0  1: Enable SGPIO0 PCLK */
#define SYSON_S_SHIFT_SYS_SGPIO0_EN                  4
#define SYSON_S_BIT_SYS_SGPIO0_EN                    ((u32)0x00000001 << 4)                              /*!<R/W 0  1: Enable SGPIO0 */
#define SYSON_S_SHIFT_SYS_I2S1_CLK_EN                3
#define SYSON_S_BIT_SYS_I2S1_CLK_EN                  ((u32)0x00000001 << 3)                              /*!<R/W 0  1: Enable I2S1 CLK */
#define SYSON_S_SHIFT_SYS_I2S1_EN                    2
#define SYSON_S_BIT_SYS_I2S1_EN                      ((u32)0x00000001 << 2)                              /*!<R/W 0  1: Enable I2S1 */
#define SYSON_S_SHIFT_SYS_I2S0_CLK_EN                1
#define SYSON_S_BIT_SYS_I2S0_CLK_EN                  ((u32)0x00000001 << 1)                              /*!<R/W 0  1: Enable I2S0 CLK */
#define SYSON_S_SHIFT_SYS_I2S0_EN                    0
#define SYSON_S_BIT_SYS_I2S0_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  1: Enable I2S0  */
/** @} */

