Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_s_type.h
/**************************************************************************//**
 * @defgroup SYSON_S_REG_OTP_AS_CTRL_S
 * @brief                                            (@ 0X13C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_OTP_MODE_SEL                   30
#define SYSON_S_MASK_OTP_MODE_SEL                    ((u32)0x00000003 << 30)                             /*!<R/W 0  OTP controller Mode (command) selection Program to this field could trigger OTP controller to do related command operation. 2'b00 :Read 2'b10 :Write 2'b01 :Autoload Enable 2'b11 :Compare Secure Data Enable */
#define SYSON_S_SHIFT_OTP_RDY                        29
#define SYSON_S_BIT_OTP_RDY                          ((u32)0x00000001 << 29)                             /*!<R/W1C 0  OTP Operation Ready bit 0: OTP controller has NOT done a requested command. 1: OTP controller has done a requested command. Note : HW set , SW clear Note before any operations, HW/SW should clear ready bit first Note: For autoload operation, this bit is not used for autoload done status. Autoload done status of each zone is shown in 0x40009128[6:4] */
#define SYSON_S_SHIFT_OTP_COMP_RESULT                28
#define SYSON_S_BIT_OTP_COMP_RESULT                  ((u32)0x00000001 << 28)                             /*!<R/W1C 0  compare result 0 : PASS 1 : FAIL Note : HW set , SW clear */
#define SYSON_S_SHIFT_OTP_OP_EN                      27
#define SYSON_S_BIT_OTP_OP_EN                        ((u32)0x00000001 << 27)                             /*!<W1Once 0  OTP controller operation enable control This bit could be set to 1 by software and automatically cleared to 0 by hardware 0: OTP controller does NOT perforam any operations even B_OTP_MODE_SEL is given by a valid value. 1: OTP controller performs corresponding operation according to B_OTP_MODE_SEL, B_OTP_ADDR and B_OTP_DATA */
#define SYSON_S_SHIFT_OTP_ADDR                       16
#define SYSON_S_MASK_OTP_ADDR                        ((u32)0x000007FF << 16)                             /*!<R/W 0  Access Address When SOC in secure state, software using this register could only access the following OTP region: Secure Control, Logical, Customer Data, Secure, Hidden. Super Secure region access depends on Super Secure Lock Control in system register bit (SEC_SUPER_SEC_OTP_LOC, 0x5000_2C20[0]) which comes from OTP secure control region. If this bit is set to 0 (default), this register could access Super Secure region. If this bit is set to 1, this register could NOT access Super Secure region. When SOC in non-secure state, software using this register could access all of the OTP region. */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
#define SYSON_S_SHIFT_RSVD7                          9
#define SYSON_S_MASK_RSVD7                           ((u32)0x0000007F << 9)                              /*!<R/W 0x00  Reserved */
#else
#define SYSON_S_SHIFT_RSVD6                          9
#define SYSON_S_MASK_RSVD6                           ((u32)0x0000007F << 9)                              /*!<R/W 0x00  Reserved */
#endif
#define SYSON_S_SHIFT_OTP_AUTO_RDCHK_CTRL            8
#define SYSON_S_BIT_OTP_AUTO_RDCHK_CTRL              ((u32)0x00000001 << 8)                              /*!<R/W 0  Automatic Read Check Control When this bit is set to 1 in OTP write mode, OTP controller would perform a write-read-check process automatically. Read back data would be compared with original write data and the result would be updated in bit28 of this register 0: Disable auto read check mechanism 1: Enable auto read check mechanism */
#define SYSON_S_SHIFT_OTP_DATA                       0
#define SYSON_S_MASK_OTP_DATA                        ((u32)0x000000FF << 0)                              /*!<R/W 0  Access Data [7:0] : Read / Write/Data to be compared */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_OTP_SCAN_TEST_S
 * @brief                                            (@ 0X140)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_AX_EF_CRES_SEL                 31
#define SYSON_S_BIT_AX_EF_CRES_SEL                   ((u32)0x00000001 << 31)                             /*!<R/W 0  1: for debug , 0: for normal */
#define SYSON_S_SHIFT_AX_EF_RSVD                     30
#define SYSON_S_BIT_AX_EF_RSVD                       ((u32)0x00000001 << 30)                             /*!<R/W 0  Reserved */
#define SYSON_S_SHIFT_AX_EF_SCAN_SADR                19
#define SYSON_S_MASK_AX_EF_SCAN_SADR                 ((u32)0x000007FF << 19)                             /*!<R/W 0  EFuse Scan start Address (unit in byte) */
#define SYSON_S_SHIFT_AX_EF_SCAN_EADR                8
#define SYSON_S_MASK_AX_EF_SCAN_EADR                 ((u32)0x000007FF << 8)                              /*!<R/W 0  EFuse Scan End address */
#define SYSON_S_SHIFT_AX_EF_SCAN_TRPT                7
#define SYSON_S_BIT_AX_EF_SCAN_TRPT                  ((u32)0x00000001 << 7)                              /*!<R/W1C 0  Test Scan Report: 1 : Fail, 0 : OK */
#define SYSON_S_SHIFT_AX_EF_SCAN_FTHR                0
#define SYSON_S_MASK_AX_EF_SCAN_FTHR                 ((u32)0x0000007F << 0)                              /*!<R/W 0  Threshold number of bit error If [6:0]=1 and scan check have any cell bit wasn't equal 1b'1(default). It will report Fail. If [6:0]=2, it mean allow one cell bit fail while HW scan was finlish and the [6:0] will write to 0 and then check result([7])  */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_DSS_CPU
 * @brief                                            (@ 0X144)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_READY                          26
#define SYSON_S_BIT_READY                            ((u32)0x00000001 << 26)                             /*!<R 0  Ready strobe to read count_out value */
#define SYSON_S_SHIFT_COUNT_OUT                      6
#define SYSON_S_MASK_COUNT_OUT                       ((u32)0x000FFFFF << 6)                              /*!<R 0  Counter value indicates the speed of selected ring oscillator Cycle time = (count_out*dss_clk period)/ 16384 */
#define SYSON_S_SHIFT_RO_SEL                         3
#define SYSON_S_MASK_RO_SEL                          ((u32)0x00000007 << 3)                              /*!<R/W 0  Ring Oscillator selection 000: select dss_clk (for test mode) 001 : select 1st ring oscillator (RVT NAND) 010 : select 2nd ring oscillator (RVT NOR) 011 : select 3rd ring oscillator (H/LVT NAND) 100 : select 4th ring oscillator (H/LVT NOR) 101 : select mixed-library ring oscillator Others : not used */
#define SYSON_S_SHIFT_WRITE_SEL                      2
#define SYSON_S_BIT_WRITE_SEL                        ((u32)0x00000001 << 2)                              /*!<R/W 0  Wire selection 0 : long wire/delay cell/clock buffer 1 : short wire */
#define SYSON_S_SHIFT_DSS_RST_N                      1
#define SYSON_S_BIT_DSS_RST_N                        ((u32)0x00000001 << 1)                              /*!<R/W 0  Reset signal of Speed-Sensor (low active) */
#define SYSON_S_SHIFT_SPEED_EN                       0
#define SYSON_S_BIT_SPEED_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  Speed sensor enable 0: disable 1: enable */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_DSS_ENCODER
 * @brief                                            (@ 0X148)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_READY                          26
#define SYSON_S_BIT_READY                            ((u32)0x00000001 << 26)                             /*!<R 0  Ready strobe to read count_out value */
#define SYSON_S_SHIFT_COUNT_OUT                      6
#define SYSON_S_MASK_COUNT_OUT                       ((u32)0x000FFFFF << 6)                              /*!<R 0  Counter value indicates the speed of selected ring oscillator Cycle time = (count_out*dss_clk period)/ 16384 */
#define SYSON_S_SHIFT_RO_SEL                         3
#define SYSON_S_MASK_RO_SEL                          ((u32)0x00000007 << 3)                              /*!<R/W 0  Ring Oscillator selection 000: select dss_clk (for test mode) 001 : select 1st ring oscillator (RVT NAND) 010 : select 2nd ring oscillator (RVT NOR) 011 : select 3rd ring oscillator (H/LVT NAND) 100 : select 4th ring oscillator (H/LVT NOR) 101 : select mixed-library ring oscillator Others : not used */
#define SYSON_S_SHIFT_WRITE_SEL                      2
#define SYSON_S_BIT_WRITE_SEL                        ((u32)0x00000001 << 2)                              /*!<R/W 0  Wire selection 0 : long wire/delay cell/clock buffer 1 : short wire */
#define SYSON_S_SHIFT_DSS_RST_N                      1
#define SYSON_S_BIT_DSS_RST_N                        ((u32)0x00000001 << 1)                              /*!<R/W 0  Reset signal of Speed-Sensor (low active) */
#define SYSON_S_SHIFT_SPEED_EN                       0
#define SYSON_S_BIT_SPEED_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  Speed sensor enable 0: disable 1: enable */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_DSS_WLAN_OFF
 * @brief                                            (@ 0X14C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_READY                          26
#define SYSON_S_BIT_READY                            ((u32)0x00000001 << 26)                             /*!<R 0  Ready strobe to read count_out value */
#define SYSON_S_SHIFT_COUNT_OUT                      6
#define SYSON_S_MASK_COUNT_OUT                       ((u32)0x000FFFFF << 6)                              /*!<R 0  Counter value indicates the speed of selected ring oscillator Cycle time = (count_out*dss_clk period)/ 16384 */
#define SYSON_S_SHIFT_RO_SEL                         3
#define SYSON_S_MASK_RO_SEL                          ((u32)0x00000007 << 3)                              /*!<R/W 0  Ring Oscillator selection 000: select dss_clk (for test mode) 001 : select 1st ring oscillator (RVT NAND) 010 : select 2nd ring oscillator (RVT NOR) 011 : select 3rd ring oscillator (H/LVT NAND) 100 : select 4th ring oscillator (H/LVT NOR) 101 : select mixed-library ring oscillator Others : not used */
#define SYSON_S_SHIFT_WRITE_SEL                      2
#define SYSON_S_BIT_WRITE_SEL                        ((u32)0x00000001 << 2)                              /*!<R/W 0  Wire selection 0 : long wire/delay cell/clock buffer 1 : short wire */
#define SYSON_S_SHIFT_DSS_RST_N                      1
#define SYSON_S_BIT_DSS_RST_N                        ((u32)0x00000001 << 1)                              /*!<R/W 0  Reset signal of Speed-Sensor (low active) */
#define SYSON_S_SHIFT_SPEED_EN                       0
#define SYSON_S_BIT_SPEED_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  Speed sensor enable 0: disable 1: enable */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_DSS_SOC
 * @brief                                            (@ 0X150)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_READY                          26
#define SYSON_S_BIT_READY                            ((u32)0x00000001 << 26)                             /*!<R 0  Ready strobe to read count_out value */
#define SYSON_S_SHIFT_COUNT_OUT                      6
#define SYSON_S_MASK_COUNT_OUT                       ((u32)0x000FFFFF << 6)                              /*!<R 0  Counter value indicates the speed of selected ring oscillator Cycle time = (count_out*dss_clk period)/ 16384 */
#define SYSON_S_SHIFT_RO_SEL                         3
#define SYSON_S_MASK_RO_SEL                          ((u32)0x00000007 << 3)                              /*!<R/W 0  Ring Oscillator selection 000: select dss_clk (for test mode) 001 : select 1st ring oscillator (RVT NAND) 010 : select 2nd ring oscillator (RVT NOR) 011 : select 3rd ring oscillator (H/LVT NAND) 100 : select 4th ring oscillator (H/LVT NOR) 101 : select mixed-library ring oscillator Others : not used */
#define SYSON_S_SHIFT_WRITE_SEL                      2
#define SYSON_S_BIT_WRITE_SEL                        ((u32)0x00000001 << 2)                              /*!<R/W 0  Wire selection 0 : long wire/delay cell/clock buffer 1 : short wire */
#define SYSON_S_SHIFT_DSS_RST_N                      1
#define SYSON_S_BIT_DSS_RST_N                        ((u32)0x00000001 << 1)                              /*!<R/W 0  Reset signal of Speed-Sensor (low active) */
#define SYSON_S_SHIFT_SPEED_EN                       0
#define SYSON_S_BIT_SPEED_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  Speed sensor enable 0: disable 1: enable */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_DSS_REF1
 * @brief                                            (@ 0X154)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_READY                          26
#define SYSON_S_BIT_READY                            ((u32)0x00000001 << 26)                             /*!<R 0  Ready strobe to read count_out value */
#define SYSON_S_SHIFT_COUNT_OUT                      6
#define SYSON_S_MASK_COUNT_OUT                       ((u32)0x000FFFFF << 6)                              /*!<R 0  Counter value indicates the speed of selected ring oscillator Cycle time = (count_out*dss_clk period)/ 16384 */
#define SYSON_S_SHIFT_RO_SEL                         3
#define SYSON_S_MASK_RO_SEL                          ((u32)0x00000007 << 3)                              /*!<R/W 0  Ring Oscillator selection 000: select dss_clk (for test mode) 001 : select 1st ring oscillator (RVT NAND) 010 : select 2nd ring oscillator (RVT NOR) 011 : select 3rd ring oscillator (H/LVT NAND) 100 : select 4th ring oscillator (H/LVT NOR) 101 : select mixed-library ring oscillator Others : not used */
#define SYSON_S_SHIFT_WRITE_SEL                      2
#define SYSON_S_BIT_WRITE_SEL                        ((u32)0x00000001 << 2)                              /*!<R/W 0  Wire selection 0 : long wire/delay cell/clock buffer 1 : short wire */
#define SYSON_S_SHIFT_DSS_RST_N                      1
#define SYSON_S_BIT_DSS_RST_N                        ((u32)0x00000001 << 1)                              /*!<R/W 0  Reset signal of Speed-Sensor (low active) */
#define SYSON_S_SHIFT_SPEED_EN                       0
#define SYSON_S_BIT_SPEED_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  Speed sensor enable 0: disable 1: enable */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_DSS_REF2
 * @brief                                            (@ 0X158)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_READY                          26
#define SYSON_S_BIT_READY                            ((u32)0x00000001 << 26)                             /*!<R 0  Ready strobe to read count_out value */
#define SYSON_S_SHIFT_COUNT_OUT                      6
#define SYSON_S_MASK_COUNT_OUT                       ((u32)0x000FFFFF << 6)                              /*!<R 0  Counter value indicates the speed of selected ring oscillator Cycle time = (count_out*dss_clk period)/ 16384 */
#define SYSON_S_SHIFT_RO_SEL                         3
#define SYSON_S_MASK_RO_SEL                          ((u32)0x00000007 << 3)                              /*!<R/W 0  Ring Oscillator selection 000: select dss_clk (for test mode) 001 : select 1st ring oscillator (RVT NAND) 010 : select 2nd ring oscillator (RVT NOR) 011 : select 3rd ring oscillator (H/LVT NAND) 100 : select 4th ring oscillator (H/LVT NOR) 101 : select mixed-library ring oscillator Others : not used */
#define SYSON_S_SHIFT_WRITE_SEL                      2
#define SYSON_S_BIT_WRITE_SEL                        ((u32)0x00000001 << 2)                              /*!<R/W 0  Wire selection 0 : long wire/delay cell/clock buffer 1 : short wire */
#define SYSON_S_SHIFT_DSS_RST_N                      1
#define SYSON_S_BIT_DSS_RST_N                        ((u32)0x00000001 << 1)                              /*!<R/W 0  Reset signal of Speed-Sensor (low active) */
#define SYSON_S_SHIFT_SPEED_EN                       0
#define SYSON_S_BIT_SPEED_EN                         ((u32)0x00000001 << 0)                              /*!<R/W 0  Speed sensor enable 0: disable 1: enable */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_S_REG_VOL_PROBE
 * @brief                                            (@ 0X15C)
 * @{
 *****************************************************************************/
#define SYSON_S_SHIFT_OE_OTP                         1
#define SYSON_S_BIT_OE_OTP                           ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SYSON_S_SHIFT_OE_AON                         0
#define SYSON_S_BIT_OE_AON                           ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

