Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_s_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_SYSON_S
 * @{
 * @brief rtl8735b_SYSON_S Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t SYSON_S_REG_SYS_PWR_CTRL ;               /*!<   register,  Address offset: 0x000 */
	__IO uint32_t SYSON_S_REG_SYS_ISO_CTRL ;               /*!<   register,  Address offset: 0x004 */
	__IO uint32_t SYSON_S_REG_SYS_CLK_CTRL ;               /*!<   register,  Address offset: 0x008 */
	__IO uint32_t SYSON_S_REG_SYS_FUNC_EN ;                /*!<   register,  Address offset: 0x00C */
	__IO uint32_t SYSON_S_REG_HS_PLATFORM_PARA ;           /*!<   register,  Address offset: 0x010 */
	__IO uint32_t SYSON_S_REG_I2S_PLL1_CTRL0 ;             /*!<   register,  Address offset: 0x014 */
	__IO uint32_t SYSON_S_REG_I2S_PLL1_CTRL1 ;             /*!<   register,  Address offset: 0x018 */
	__IO uint32_t SYSON_S_REG_I2S_PLL1_CTRL2 ;             /*!<   register,  Address offset: 0x01C */
	__IO uint32_t SYSON_S_REG_I2S_PLL1_CTRL3 ;             /*!<   register,  Address offset: 0x020 */
	__IO uint32_t SYSON_S_REG_I2S_PLL2_CTRL0 ;             /*!<   register,  Address offset: 0x024 */
	__IO uint32_t SYSON_S_REG_I2S_PLL2_CTRL1 ;             /*!<   register,  Address offset: 0x028 */
	__IO uint32_t SYSON_S_REG_I2S_PLL2_CTRL2 ;             /*!<   register,  Address offset: 0x02C */
	__IO uint32_t SYSON_S_REG_I2S_PLL2_CTRL3 ;             /*!<   register,  Address offset: 0x030 */
	__IO uint32_t SYSON_S_REG_ISP_PLL_CTRL0 ;              /*!<   register,  Address offset: 0x034 */
	__IO uint32_t SYSON_S_REG_ISP_PLL_CTRL1 ;              /*!<   register,  Address offset: 0x038 */
	__IO uint32_t SYSON_S_REG_ISP_PLL_CTRL2 ;              /*!<   register,  Address offset: 0x03C */
	__IO uint32_t SYSON_S_REG_ISP_PLL_CTRL3 ;              /*!<   register,  Address offset: 0x040 */
	__IO uint32_t SYSON_S_REG_LDO_SDIO_CTRL ;              /*!<   register,  Address offset: 0x044 */
	__IO uint32_t SYSON_S_REG_SYS_MEM_CTRL ;               /*!<   register,  Address offset: 0x048 */
	__IO uint32_t SYSON_S_REG_RSVD1 ;                      /*!<   register,  Address offset: 0x04C */
	__IO uint32_t SYSON_S_REG_RSVD2 ;                      /*!<   register,  Address offset: 0x050 */
	__IO uint32_t SYSON_S_REG_SYS_SCE_EXMEM_CTRL0 ;        /*!<   register,  Address offset: 0x054 */
	__IO uint32_t SYSON_S_REG_SYS_SCE_EXMEM_CTRL1 ;        /*!<   register,  Address offset: 0x058 */
	__IO uint32_t SYSON_S_REG_SYS_SCE_FLASH_CTRL0 ;        /*!<   register,  Address offset: 0x05C */
	__IO uint32_t SYSON_S_REG_SYS_SCE_FLASH_CTRL1 ;        /*!<   register,  Address offset: 0x060 */
	__IO uint32_t SYSON_S_REG_SYS_SEC_EFUSE_CTRL0 ;        /*!<   register,  Address offset: 0x064 */
	__IO uint32_t SYSON_S_REG_SEC_MASTER_SLAVE_PORT_IP_DIS ;/*!<   register,  Address offset: 0x068 */
	__IO uint32_t SYSON_S_REG_SEC_SLAVE_PORT_IP_DIS ;      /*!<   register,  Address offset: 0x06C */
	__IO uint32_t SYSON_S_REG_RSVD3 ;                      /*!<   register,  Address offset: 0x070 */
	__IO uint32_t SYSON_S_REG_SYS_SEC_CTRL ;               /*!<   register,  Address offset: 0x074 */
	__IO uint32_t SYSON_S_REG_SYS_RSA_FUNC_CTRL ;          /*!<   register,  Address offset: 0x078 */
	__IO uint32_t SYSON_S_REG_RSVD4 ;                      /*!<   register,  Address offset: 0x07C */
	__IO uint32_t SYSON_S_REG_SYS_LPDDR1_CTRL ;            /*!<   register,  Address offset: 0x080 */
	__IO uint32_t SYSON_S_REG_SYS_DDRPHY_CTRL ;            /*!<   register,  Address offset: 0x084 */
	__IO uint32_t SYSON_S_REG_SYS_SHARE_MEM_CTRL ;         /*!<   register,  Address offset: 0x088 */
	__IO uint32_t SYSON_S_REG_SYS_FLASH_CTRL ;             /*!<   register,  Address offset: 0x08C */
	__IO uint32_t SYSON_S_REG_SYS_FLASH_PHY_CTRL0 ;        /*!<   register,  Address offset: 0x090 */
	__IO uint32_t SYSON_S_REG_SYS_FLASH_PHY_CTRL1 ;        /*!<   register,  Address offset: 0x094 */
	__O  uint32_t SYSON_S_RSVD ;                           /*!<   register,  Address offset: 0x098 */
	__IO uint32_t SYSON_S_REG_SYS_PLATFORM_CTRL0 ;         /*!<   register,  Address offset: 0x09C */
	__IO uint32_t RSVD0[24];                               /*!<  Reserved,  Address offset:0xA0-0xFC */
	__IO uint32_t SYSON_S_REG_SYS_FEPHY_CTRL ;             /*!<   register,  Address offset: 0x100 */
	__IO uint32_t SYSON_S_REG_SYS_TIMER_CTRL ;             /*!<   register,  Address offset: 0x104 */
	__IO uint32_t SYSON_S_REG_SYS_ADC_CTRL0 ;              /*!<   register,  Address offset: 0x108 */
	__IO uint32_t SYSON_S_REG_SYS_ADC_CTRL1 ;              /*!<   register,  Address offset: 0x10C */
	__IO uint32_t SYSON_S_REG_GPIO_CTRL ;                  /*!<   register,  Address offset: 0x110 */
	__IO uint32_t SYSON_S_REG_SYS_AUDIO_CTRL ;             /*!<   register,  Address offset: 0x114 */
	__IO uint32_t SYSON_S_REG_SYS_ISP_CTRL ;               /*!<   register,  Address offset: 0x118 */
	__IO uint32_t SYSON_S_REG_SYS_NN_CTRL ;                /*!<   register,  Address offset: 0x11C */
	__IO uint32_t SYSON_S_REG_SYS_OTG_CTRL ;               /*!<   register,  Address offset: 0x120 */
	__IO uint32_t SYSON_S_REG_SYS_SDIO_SD_CTRL ;           /*!<   register,  Address offset: 0x124 */
	__IO uint32_t SYSON_S_REG_SYS_RMII_CTRL ;              /*!<   register,  Address offset: 0x128 */
	__IO uint32_t SYSON_S_REG_SYS_UART_CTRL ;              /*!<   register,  Address offset: 0x12C */
	__IO uint32_t SYSON_S_REG_SYS_I2C_CTRL ;               /*!<   register,  Address offset: 0x130 */
	__IO uint32_t SYSON_S_REG_SYS_SPI_CTRL ;               /*!<   register,  Address offset: 0x134 */
	__IO uint32_t SYSON_S_REG_SYS_I2S_CTRL ;               /*!<   register,  Address offset: 0x138 */
	__IO uint32_t SYSON_S_REG_OTP_AS_CTRL_S ;              /*!<   register,  Address offset: 0x13C */
	__IO uint32_t SYSON_S_REG_OTP_SCAN_TEST_S ;            /*!<   register,  Address offset: 0x140 */
	__IO uint32_t SYSON_S_REG_DSS_CPU ;                    /*!<   register,  Address offset: 0x144 */
	__IO uint32_t SYSON_S_REG_DSS_ENCODER ;                /*!<   register,  Address offset: 0x148 */
	__IO uint32_t SYSON_S_REG_DSS_WLAN_OFF ;               /*!<   register,  Address offset: 0x14C */
	__IO uint32_t SYSON_S_REG_DSS_SOC ;                    /*!<   register,  Address offset: 0x150 */
	__IO uint32_t SYSON_S_REG_DSS_REF1 ;                   /*!<   register,  Address offset: 0x154 */
	__IO uint32_t SYSON_S_REG_DSS_REF2 ;                   /*!<   register,  Address offset: 0x158 */
	__IO uint32_t SYSON_S_REG_VOL_PROBE ;                  /*!<   register,          Address offset: 0x15C */
} SYSON_S_TypeDef;
/** @} */

#endif
